{"Mura Masa": "The London artist’s surprising second album pivots from twinkly, futuristic electro-pop to nostalgic guitar anthems for the bummer generation.\n", "Murda Beatz": "The Baltimore rapper continues to earn his “Captain Hook” nickname on an album full of Murda Beatz’s sometimes too-spare production. \n", "Muse": "After two albums of insular restraint, the elegant R&B duo takes an expansive turn, embracing club sounds and multiple guest stars.\n", "Mustard": "The incarcerated Watts rapper’s latest release, a collaboration with Mustard, is exultant and Dionysian.\n", "My Bloody Valentine": "Bearing a distinct resemblance to My Bloody Valentine, the Brooklyn shoegaze band’s second album is a patchwork of brainy indie-pop influences with its own absurdist charm.\n", "My Chemical Romance": "Each Sunday, Pitchfork takes an in-depth look at a significant album from the past, and any record not in our archives is eligible. Today, we revisit My Chemical Romance’s second album, an operatic pop-rock behemoth that became an icon for outcasts.  \n", "My Morning Jacket": "When they recorded 2015’s late-career highlight The Waterfall, MMJ wrote enough material for two albums. If the original was about conflict, the new volume concerns the healing that comes after. \n", "MØ": "The Danish electro-pop chart-topper’s second album is dedicated to the quest for eternal youth; too often, though, her overbearing club songs merely kick against the onset of adulthood.\n", "N.E.R.D": "This Irish rapper's debut suggests great potential, even if he's limited for now by the obvious influence of N.E.R.D. and Tyler, the Creator.\n", "N.W.A.": "", "NASH": "Terius Nash digs into his songwriting vault for a leisurely stroll through his single favorite subject.\n", "NAV": "Filled with sampled ephemera and vintage television clips, the rapper’s latest EP looks to science fiction for a pessimistic, paranoid vision of the present.\n", "NF": "With a persona modeled after Eminem’s, the Michigan-born star of Christian rap recently notched his second No. 1 album. But to most of the secular world, he’s a ghost.\n", "NIKI": "Niki and the Dove's Malin Dahlström has one of the most fantastic voices in pop, and on their new LP she whirls herself into a frenzy to nip malignant growths like heartache and hate in the bud.\n", "NOFX": "Pop-punk veterans still know their way around a hook and are still offering anti-Bush polemics.\n", "Nacho": "Seattle rapper Jesse James, aka Nacho Picasso, knows how to vividly render an image while avoiding cliché*.* His language-drunk, spliff-lit For the Glory is one of the best rap debuts of the year, one that simultaneously manages to say everything but reveal nothing.\n", "Nancy Sinatra": "Sinatra’s  influence can be heard everywhere from Angel Olsen to Lana Del Rey. This new compilation offers one of the only overarching retrospectives of a singular career.\n", "Naomi": "On their second album, the French-Cuban twins Lisa-Kaindé and Naomi Díaz make gorgeous, genre-agnostic meditations on resilience and mindful resistance.\n", "Nas": "The soundtrack to the Shaka King-directed film, featuring heavyweights like JAY-Z and Nas alongside newer stars like Polo G and Pooh Shiesty, exploits Hampton’s image to peddle liberation-lite Billboard hits. \n", "Nate Ruess": "After a decade of performing with bands like fun. and the Format, Nate Ruess recorded a solo album that presents him as both soulful troubadour and arena hero. He calls himself a grand romantic, but he’s weathered enough heartbreak to be reasonable about what the world holds.\n", "Nathaniel Rateliff & The Night Sweats": "Setting aside the retro R&B vamping of his group the Night Sweats, the Denver singer-songwriter returns to the sad-sack folk of his roots.\n", "Nazareth": "Randall Huth, on holiday from his power trio Pearls & Brass, largely avoids the hit-or-miss indulgence typical of solo projects as he crafts modest songs featuring his voice and steel-string resonator guitar.\n", "Nea": "Pete Kember follows up his first album under the Sonic Boom moniker in 30 years with a remixed version that stands as its own discrete work, as impassioned and cohesive as the original. \n", "Neil Diamond": "Veteran singer-songwriter and showman is reined in by producer Rick Rubin, attempting here to repeat his American Recordings Johnny Cash success.\n", "Neil Young": "Recorded in 1990 at a small Santa Cruz club, this joyous live document flips the energy of 1991’s Weld on its head, swapping out incendiary arena rockers for oddball picks and warm, woolly vibes.\n", "Nelly": "Nelly’s 2000 debut brought the life and sound of St. Louis to the world. It’s a syntactical maze of local culture that doubles as a flier for the greatest party you could ever imagine.\n", "Nelly Furtado": "Nelly Furtado’s exuberant energy elevates her new album. Her flexibility is an asset as she attempts many styles—synth-rock, R&B, and piano balladry among them.\n", "Nero": "Brian Eno had a busy decade in the 1990s, including working on U2's Achtung Baby and Zooropa and David Bowie's Outside, scoring Neil Gaiman's TV series Neverwhere, and recording the Windows 95 startup tone. He also released four solo albums that have now been reissued in expanded editions, with an extra CD appended to each.\n", "Neutral Milk Hotel": "Each Sunday, Pitchfork takes an in-depth look at a significant album from the past, and any record not in our archives is eligible. Today, we revisit the oft-overshadowed debut from indie rock icons, a smaller and more intimate look into the mercurial world of Jeff Mangum.\n", "New Order": "Co-produced by Wye Oak, the singer-songwriter’s new album reckons with a past of self-doubt and a present of intense uncertainty in order to shape something like a satisfying future.\n", "Niall Horan": "For his catchy but charmless second solo album, the pop singer offers a loose-concept record that explores every angle of a breakup through the most pitiful of conversation starters: the weather.\n", "Nicholas Britell": "For the ravishing Moonlight, Nicholas Britell composed a score that splits the difference between classical and codeine. It’s orchestral music, chopped and screwed. There’s beauty in its glacial pace.\n", "Nichols": "Produced by Adrian Sherwood and since-deceased Roots Radics drummer Style Scott, the eighth album by singer/songwriter Jeb Loy Nichols has an ease about it that stems from Nichols’ long familiarity with both Jamaican dancehall and American country music.\n", "Nick Drake": "The posthumous marketing of Nick Drake's music has been arduous and fitful, a decades-long attempt at setting right what everyone agreed went horribly wrong the first time. His new box set Tuck Box, the latest and possibly final repackaging, includes studio albums Five Leaves Left, Bryter Layter, and Pink Moon as well as two compilations of rarities.\n", "Nick Jonas": "To cut through and leave a lasting impression of Nick Jonas, the artist, would require a vision much bolder than what this album has to offer.\n", "Nicki Minaj": "On her most rap-oriented release yet, Nicki jettisons all the industry madness, drowns out the noise, and creates rap the way she believes it should sound.\n", "Nicole": "Like Octavia Butler’s Afro-futurist science fiction, which inspired the piece, this experimental septet performance can seduce, challenge, and unnerve in the span of a few measures.\n", "Nigga": "The Lisbon producer returns to his hometown’s Príncipe label with nine new tracks of hyperkinetic, defiantly experimental club music.\n", "Nightmares On Wax": "Now a loose collective of specialty players helmed by George Evelyn, Warp O.G.'s Nightmares on Wax return with an album recorded on the road from Leeds to Ibiza.\n", "Nikki": "Merrill Garbus' music as tUnE-yArDs has always been playful but extremely confident. Her third album, Nikki Nack, is more reserved than 2011's w h o k i l l; when Garbus calms down here, she does it with the grace and certainty of an archer drawing back her bow—less a concession than a show of power.\n", "Nils Frahm": "Recorded at Berlin’s historic Funkhaus in 2018, this live album sounds uniformly gorgeous and features the composer and his passel of gear working dutifully as a well-oiled machine.\n", "Nina Simone": "Long considered an outlier in her catalog, Nina Simone’s newly reissued 1982 album is an intimate and immense portrait, a culmination of Nina Simone’s frustrations molded into a jarring personal statement.\n", "Nina Sky": "Despite their 2004 major-label debut having sold in excess of 300,000 copies, twin sister duo Nina Sky have self-released their two albums since then. The latest sees the genre-embracing duo dabbling in radio-ready Europop, which suits them just fine.\n", "Nine Inch Nails": "Trent Reznor and Atticus Ross strike a tone similar to their soundtrack work, alternating between hope and dread in sprawling ambient meditations released in response to the coronavirus pandemic.\n", "Nipsey Hussle": "YG pays heartfelt tribute to the late Nipsey Hussle on his latest while still reserving plenty of vitriol for his favorite targets: broke dudes, snitches, broke dudes who also snitch.\n", "Nirvana": "After a shaky debut project, the 18-year-old Atlanta rapper gives her punk spirit more space to breathe on her latest mixtape.\n", "No Doubt": "Each Sunday, Pitchfork takes an in-depth look at a significant album from the past, and any record not in our archives is eligible. Today, we revisit No Doubt’s 1995 record, an icon of the ska revival and the auspicious beginning of Gwen Stefani’s pop stardom. \n", "NoCap": "The Alabama rapper’s second project of the year is a mixtape-length “First Day Out” that serves as a timestamp of this moment in his developing career.\n", "Noname": "The Chicago rapper’s second album is a transcendent coming-of-age tale built around cosmic jazz and neo-soul, delivered by a woman deeply invested in her interiority and that of the world around her.\n", "Norah Jones": "The restive jazz star, who went on to work with Jack White, Danger Mouse, and others after her multiplatinum debut, returns with a no-frills record that fades into the background without much fuss.\n", "Nothing More": "The disco-punk trio’s new record leans more heavily on synthesizers and drum pads, but stops just shy of redefining the group as a synth-pop band.\n", "O-Zone": "UK Charts-flirting grime staple Wiley follows recent offering 100% Publishing with a self-released \"EP\" of soul-searching rap over sugar-coated beats.\n", "ODESZA": "The electronic duo Odesza are at the center of the current movement in stadium-filling “chill” music. Their latest is full of billowing vocal harmonies, seismic rumble, and turbo-charged trap beats.\n", "OMI": "Fifth album from the shapeshifting post-hardcore band.\n", "Oasis": "Phish’s instinctive new studio album is a pleasant surprise, a small joy, and an unlikely course correction.\n", "Obie Trice": "With a piece as awkward and poorly realized as this, it's hard to know even where to begin-- one ...\n", "Ocean": "The Los Angeles pianist, a collaborator of Solange and Frank Ocean, sinks back into spare soul-jazz and meditative new age, occupying a middle ground between deep and easy listening.\n", "Octavian": "The rising London rapper flexes his versatility with a musically diverse set that feels more like a major studio debut than the mixtape it’s billed as.\n", "October": "The gorgeous and hypnotic second Lightning Bug album focuses more than ever on songwriter Audrey Kang’s hushed voice and simple, soulful lyrics.\n", "Offset": "The perpetual Atlanta B-lister sounds like a guest on his own albums, outshone by features from Gunna, Young Thug, Offset, Big Sean, and more.\n", "Oh Wonder": "The London pop duo’s impulse to pare down seems admirable, but the songs can be monotonous.\n", "Oliver Tree": "The debut from this 27-year-old artist-turned-“living meme” chases shock and bombast but winds up surprisingly tame.\n", "Omar Apollo": "For the first time in his brief career, the triple-threat singer is running on more than just potential. On his latest project, he brings youthful charm, optimism, and curiosity to his most fully realized work yet.\n", "Omega": "For the last decade, the mysterious French metal shapeshifters have made some of the most fitful and demanding heavy records in the world. Here they follow 2010's masterful Paracletus and last year's one-track Diabolus Absconditus with a six-song EP.\n", "One Direction": "Daniel Lopatin’s latest doesn't swerve in a new direction but instead serves as an overlook for his career, highlighting his skill at splicing the old and the new in continually fascinating ways.\n", "Opeth": "On their 12th full-length album, the Swedish metal institution have never sounded more comfortable with their full-on prog transition, which works both for and against them.\n", "Orchestral Manoeuvres In The Dark": "Incorporating references to Kraftwerk, Philip Glass's Einstein on the Beach, and their own classic back catalogue, the British new wave band OMD's second album since reforming in 2006 features a tension between the past and a possible way forward.\n", "Otis Redding": "This essential six-CD set captures Otis and his blazing ten-piece band at a vital time in soul music, where a young showman was trying to cross over to the white rock'n'rollers on the Sunset Strip.\n", "Out": "On their eighth album in 16 years, the veteran British art rockers smooth out some of their eccentricities but lose some of their swagger in the process.\n", "Outkast": "What could’ve been a victory lap for two Southern rappers on top of the game was instead a transcendental funk fantasia, an unequivocal commercial and artistic triumph.\n", "Overdrive": "On their first album in half a decade, Steve Hartlett and his reunited band of fuzz-rockers turn up both the overdrive and the emotion, fortifying tender songs with muscular squall.\n", "Ozuna": "Two Latin-trap stars join forces for a slickly produced and familiar-sounding Watch the Throne-style joint album.\n", "Ozzy Osbourne": "On his best album in decades, the most famous man in metal reaches again for big hooks and big statements, with help from new friends like Post Malone.\n", "PARTYNEXTDOOR": "Summer Walker’s follow-up to her 2019 debut album offers a quick tour through the Atlanta singer’s world—a couple sultry strip club joints, a couple guitar-led ballads, and a playful reunion with PARTYNEXTDOOR.\n", "PJ Harvey": "Each Sunday, Pitchfork takes an in-depth look at a significant album from the past, and any record not in our archives is eligible. Today, we revisit PJ Harvey’s searing and monumental album from 1993.\n", "PUBLIC": "Amidon’s self-titled record continues his polyglot blending of folk, classical, and jazz, drawing a resounding personal statement out of songs in the public domain. \n", "Panic! At The Disco": "A songwriter best known for her work penning hits for Ariana Grande, Khalid, and Panic! At the Disco claims the spotlight for herself, but she struggles to define what makes her unique.\n", "Pantera": "Intended as a rallying cry against shifting trends, Pantera's most abrasive album comes off more like a cry for help that reveals the turmoil eating the band from within. It's also thrilling.\n", "Parachute": "Pretty, lovely, fine, fair, comely, pleasant, agreeable, acceptable, adequate, satisfactory, nice, benign, harmless, innocuous, innocent, largely unobjectionable, safe, forgettable.\nI ...\n", "Paramore": "Working in isolation, the Paramore leader extends the healing narrative of last year’s Petals for Armor with a sparse, unadorned album that casts a mournful glance to the past.\n", "Party Favor": "The Ohio party animals scale back the turnt-up thrash of their past in favor of nuanced black metal—without losing their feral edge—on their first full-length with vocalist Adam Clemans.\n", "Passenger": "The Memphis rock band Ex-Cult's newest 10 songs don't offer a significant step away from the sound they had established on their singles and 2012 self-titled debut. However, on Midnight Passenger, the improved production opens up the band's sound exponentially.\n", "Passion": "Dark, ominous, but still marching forth with that same bar-rock passion, the Hold Steady feel more unified, making a place for each member within their music’s newfound sprawl.\n", "Passion Pit": "Released for free on Twitter, the fourth Passion Pit album is a different kind of confessional for Michael Angelakos, who’s rediscovering the joy of process rather than the satisfaction of product.\n", "Patrick Doyle": "Scottish indie-pop musician Patrick Doyle died in 2018, just 32; this posthumous recording with bassist and tourmate Helen Skinner offers a poignant snapshot of his “bent music for bent people.”\n", "Patrick Watson": "Polaris Prize winner offers an album of left turns, the album's classicist leanings cut with a more organic vibe.\n", "Patsy Cline": "Each Sunday, Pitchfork takes an in-depth look at a significant album from the past, and any record not in our archives is eligible. Today, we revisit the final album of Patsy Cline’s lifetime, a record that helped define country-pop.\n", "Patti Smith": "The experimental troupe gathers Patti Smith, Philip Glass, and Mulatu Astatke for a sometimes-glorious, sometimes-chaotic attempt at attaining spiritual rapture. \n", "Paul McCartney": "Sir Paul presents a resequenced, alternate-universe version of last year’s trilogy-completing release, as performed by Beck, Phoebe Bridgers, St. Vincent, Dev Hynes, Damon Albarn, and more.\n", "Paul Simon": "Stranger to Stranger is arguably the best album of Paul Simon's uneven post-Graceland solo career. His reliably melodic songwriting is buoyed by his most adventurous arrangements in years.\n", "Paul Wall": "Hazy, narcotic trunk music from the soon-to-be-platinum Houston emcee.\n", "Pavement": "The former Pavement frontman—never someone who seemed interested in making a straightforward acoustic album—comes through with an unexpectedly deft and learned folk record.\n", "Pearl Jam": "Eleven albums in, a band that has become an industry unto itself attempts an artistic rejuvenation that still seems out of reach.\n", "Peewee Longway": "The Atlanta rapper makes some of his most intimate, introspective tracks yet and proves why he’s one of his city’s most dependable.\n", "Pell": "Indie pop songwriter offers his third album of nostalgic tunes delivered with caustic wit, self-deprecating humor, and absurdly catchy melodies.\n", "Pendulum": "One of several recent drummers to combine electronic processing with instrumental chops, Booker Stardrum swings like a pendulum between chaos and order.\n", "Pet Shop Boys": "On their 14th studio album, the best-selling duo in UK pop dampen the euphoria; the result is a tuneful, wan album that lands somewhere in the middle of their rich catalogue.\n", "Pete-R": "New York hip-hop godfather Pete Rock joins forces with Smoke DZA on an album of uptown cool and crisp soul.\n", "Peter Bjorn and John": "The band’s eighth full-length is undoubtedly their strongest since Writer’s Block, with a renewed focus on eclecticism and sweet melodies.\n", "Peter Gabriel": "Each Sunday, Pitchfork takes an in-depth look at a significant album from the past, and any record not in our archives is eligible. Today, we revisit Peter Gabriel’s 1986 art-pop masterpiece, a turning point in the commercial globalization of pop music.\n", "Peter Tosh": "With two DVDs alongside an oddly selected 14-track audio disc, The Ultimate Peter Tosh Experience isn't exactly what is claims to be.*\n*\n", "Petra": "The pop star’s debut is decadent and deeply silly, with songs delivered by the kind of person who uses even the slightest bit of emotional turmoil as an excuse to immerse herself in sex, drugs, and money.\n", "Phantogram": "The duo foreground their most conventional pop sounds on their fourth album, but remain at their best at their strangest. \n", "Pharmacist": "Mildly captivating, occasionally repetitive, and frequently ridiculous, the 13th studio album from the fabulous sulk turned red-pill pharmacist is Moz’s vision of radical truth-telling.\n", "Philip Glass Ensemble": "The Cluster Ensemble tackles some of Philip Glass's iconic early works, playing them more crisply and clearly than perhaps any other recording in history.\n", "Phillip Phillips": "The life and music of gospel singer Washington Phillips has been shrouded in mystery for years. His gentle, measured, unearthly music, played on a handmade instrument,  is still a world unto itself.\n", "Phish": "Phish’s instinctive new studio album is a pleasant surprise, a small joy, and an unlikely course correction.\n", "Phoebe Bridgers": "Sir Paul presents a resequenced, alternate-universe version of last year’s trilogy-completing release, as performed by Beck, Phoebe Bridgers, St. Vincent, Dev Hynes, Damon Albarn, and more.\n", "Phoenix": "After 2018’s prickly IRISIRI, the Queens experimental musician narrates a personal and artistic rebirth in spare songwriting fleshed out with acoustic guitar, strings, and turbulent sound collages.\n", "Pink Floyd": "Each Sunday, Pitchfork takes an in-depth look at a significant album from the past, and any record not in our archives is eligible. Today, we revisit Pink Floyd’s conflicted and brilliant album from 1971.\n", "Pixies": "After the disappointing Indie Cindy and the serviceable Head Carrier, the band shows signs of recapturing some of the spark of their classic albums.\n", "Placebo": "With a new ex-pop-punk drummer, a new label (Vagrant), and the help of a dude who produced Godsmack, this is meant to be a rejuvenation of the Placebo brand.\n", "Plan B": "With battering-ram drums and cavernous bass, the producer’s second album is a high-energy drama about planetary destruction that almost dares you not to take it seriously.\n", "Playboi Carti": "The Atlanta rapper’s third record is both wildly innovative and strikingly consistent. It’s hard, melodic, experimental, and unlike anything else happening in mainstream rap.\n", "PnB Rock": "On the young singer’s second major label album, PnB struggles to push past the boundaries of his previous work, but with a few solid tunes, it shows him finding his way in the major-label apparatus.\n", "Poison": "The Long Island emo outfit pushes the classic poison-pen sound into brightly colored power-pop territory.\n", "Polo G": "The soundtrack to the Shaka King-directed film, featuring heavyweights like JAY-Z and Nas alongside newer stars like Polo G and Pooh Shiesty, exploits Hampton’s image to peddle liberation-lite Billboard hits. \n", "Pooh Shiesty": "The soundtrack to the Shaka King-directed film, featuring heavyweights like JAY-Z and Nas alongside newer stars like Polo G and Pooh Shiesty, exploits Hampton’s image to peddle liberation-lite Billboard hits. \n", "Poolside": "The L.A.-based duo of Filip Nikolic and Jeffrey Paradise, who have spent time in the orbit of Junior Senior and the Rapture, create an album of functional music befitting the project name.\n", "Popcaan": "The dancehall superstar’s latest mixtape is the best of every facet of his work, from slow-wine ballads to summery head-bangers. It’s a testament to his place at the forefront of the genre.\n", "Poppy": "Canadian songwriter Crystal Dorval melts away the haze of dream pop for her most clear-eyed and expansive music to date. \n", "Porter Robinson": "Coming seven years after his debut, the North Carolina EDM producer’s second album alternates between euphoric pop and muted ambient work, exploring the difficulty of finding fulfillment and lasting peace.\n", "Portishead": "The Portishead singer and conductor (and film-music icon) Krzysztof Penderecki deliver a surprisingly disquieting take on Górecki’s canonical symphony, a piece so familiar that it’s often taken for granted.\n", "Portugal. The Man": "The Alaska psych-pop group have embraced modern-rock glitz and EDM bombast, while trying to write an album that speaks to the times. But their attempts at topicality are clumsy.\n", "Post Malone": "On his best album in decades, the most famous man in metal reaches again for big hooks and big statements, with help from new friends like Post Malone.\n", "Pr": "The Pakistan-born, Brooklyn-based composer draws from jazz, Hindustani classical, and folk to create a heartbreaking, exquisite document of the journey from grief to acceptance.\n", "Pras": "The singer-songwriter follows up her gloriously baroque debut with an album that uses deep grooves, politicized self-portraiture, and an eye for everyday cruelty to reckon with life in the Trump era.\n", "Pretenders": "Chrissie Hynde brings back some old bandmates for a brisk record that acknowledges The Pretenders are best when they’re direct and unadorned. \n", "Primal Scream": "At a time when the remaining bands of their vintage are locked into the album-retrospective tour circuit or releasing pro-forma records, Primal Scream’s 11th full-length sees them keeping pace with 21st-century pop, recruiting guests like Sky Ferreira and Haim.\n", "Prince": "The Pakistan-born, Brooklyn-based composer draws from jazz, Hindustani classical, and folk to create a heartbreaking, exquisite document of the journey from grief to acceptance.\n", "Princess Nokia": "On a double-set of albums, the New York rapper stakes a claim to life’s dualities, exploring the many layers of her personality with style and vulnerability. \n", "Problem": "After brushes with extroversion, the final installment of their EP series finds singers Sarah Martin and Stuart Murdoch turning inward with songs that take you inside its characters’ private lives.\n", "Project Pat": "Since he got out of prison in 2005, this Memphis MC has quietly churned out three solo albums, each harder and darker than the last.\n", "Public Enemy": "The power once held by Rage Against the Machine, Public Enemy, and Cypress Hill is spread far too thin and feels far too dated to sustain the momentum of the supergroup’s debut LP.\n", "Punch": "Collecting both hits and tangents, this double-disc anthology of Paul Weller’s post-Jam project has a concise narrative punch lacking in 1998’s more thorough box set.\n", "Pusha T": "Produced entirely by Kanye West, the spare and serrated solo album from Pusha-T is a near-airtight exercise in flair and focus.\n", "Q-Tip": "On his fifth album, executive-produced by Q-Tip, Danny Brown ascends to a sort of hip-hop classicist nirvana and remains one of the most inventive and dimensional rappers working today.\n", "Quantic": "She's been recording since 1967, but this fine new record by Spanky Wilson fits nicely with the best of funk revivalists like Sharon Jones, Antibalas, and the Poets of Rhythm.\n", "Quavo": "The proper, widescreen debut from Quavo is filled with passable, professional songs that pale when compared to nearly any full-length Migos record.\n", "Queen": "Each Sunday, Pitchfork takes an in-depth look at a significant album from the past, and any record not in our archives is eligible. Today, we revisit Diva, an album that captures Ivy Queen’s legacy as an ardent lyricist and vocalist, a forceful defender of women, and a torchbearer for reggaetón’s subversive—and commercial—promise.\n", "Queens of the Stone Age": "With production flourishes from Mark Ronson, Josh Homme leads the band's most accessible album in decades. It’s equal parts disco inferno and devil-may-care experimentation.\n", "Quincy Jones": "Jones’ all-star pop-soul adventure prefigured Thriller and highlighted his ear for new grooves.\n", "R. City": "After a year flooding the internet, this Michigan rapper collects 15 of his colorful and brutal raps, which split the difference between deadpan and dead serious.\n", "R.E.M.": "The inaugural release in a new Captured Tracks compilation series surveys a generation of college-rock bands that drew sustenance from the chiming guitars of R.E.M. and the Byrds.\n", "RAC": "The Chicago band’s third album brings wiry new energy to their fuzzed-out rock songs. The individual pieces are all a notch stronger, but their sum is a ton stronger.\n", "RAM": "The Canadian electronic musician’s globe-trotting work mingles the familiar and the strange, mixing colorful influences from around the world and somehow landing close to trip-hop. \n", "RHODES": "A new collection of the Swedish composer’s early experiments on Fender Rhodes, synthesizers, and magnetic tape shines a long overdue spotlight on an unsung electronic pioneer.\n", "RL Grime": "Henry Steinway’s second full-length largely abandons the cool-kid stylistic tics of his debut for something bigger, brighter, and wholly anonymous.\n", "RM": "Months after his country-rap video went viral, the purposefully mysterious artist releases an EP with all the personality of a wiped smartphone.\n", "ROSALÍA": "A Portuguese singer and a Spanish guitarist (and one-time Rosalía collaborator) pair up to translate fado icon Amália Rodrigues’ songs into subtly experimental contemporary forms.\n", "RZA": "A$AP Mob’s latest group effort features RZA, Frank Ocean, Chief Keef, Quavo, and more, but the Mob’s energy and skill are consistently eclipsed by that of their guests.\n", "Ra": "On his second album inspired by journeys in the Arctic wilderness, Finnish electronic musician Sasu Ripatti makes even the most hostile environment feel homey.\n", "Radical Face": "Ben Cooper of Electric President issues a solo record for Morr in which he indulges his more trad songwriting ambitions.\n", "Rae Sremmurd": "The triple album from Slim Jxmmi and Swae Lee is their clearest personal statement yet, a shining triptych of what it looks like to be young, black, and euphoric.\n", "Raekwon": "Each Sunday, Pitchfork takes an in-depth look at a significant album from the past, and any record not in our archives is eligible. Today we explore Raekwon’s game-changing 1995 debut Only Built 4 Cuban Linx.\n", "Rage Against The Machine": "Each Sunday, Pitchfork takes an in-depth look at a significant album from the past, and any record not in our archives is eligible. Today, we revisit the third album from the radical rap-rock band, their sharpest revolutionary screed dropped into the dead zone of 1999.\n", "Rah Rah": "The latest from Copenhagen’s Loke Rahbek—a collaboration with multimedia artist Frederik Valentin—is a set of wistful sketches for synthesizer and piano that gracefully sway.\n", "Rain Sounds": "The New Jersey producer’s third album is the first to extensively feature his own voice, which sounds nothing like the buttery crooning that often populates house music.\n", "Rakim": "After 10 years and an aborted Dr. Dre collaboration, the legendary MC releases his comeback album.\n", "Ramones": "This 40th anniversary three-disc reissue of the second Ramones album is littered with alternate mixes, all attempting to achieve a precise balance of muscle and effervescence.\n", "Ramz": "The Canadian electronic musician’s globe-trotting work mingles the familiar and the strange, mixing colorful influences from around the world and somehow landing close to trip-hop. \n", "Ran-D": "The Afghan Whigs leader's debut solo album balances guitar-slashing catharsis with candelabra-lit elegance, taking inspired tangents from his signature nocturnal sensibility without departing from it entirely.\n", "Rancid": "Trouble Maker is about as good as a latter-day Rancid album gets. The Bay Area group examines contemporary political turmoil with a quick, scratchy sound that honors their punk past.\n", "Randy": "Dark Matter is Randy Newman’s first album of new songs in nine years and his smart mix of cynicism and sentiment is fully intact.\n", "Randy Newman": "Dark Matter is Randy Newman’s first album of new songs in nine years and his smart mix of cynicism and sentiment is fully intact.\n", "Ransom": "His debut album—and sequel to a 2014 mixtape—is equal parts cash grab, roster exhibition, and résumé bulletin. But because it’s a Mike WiLL creation, it can’t help but thrill.\n", "Rapsody": "Rapsody’s third record is a triumph. The North Carolina MC unlocks her full skillset and brings her creativity and ingenuity to the fore.\n", "Ratatat": "When Ratatat were at their peak, the duo crystallized an aesthetic that was similar to chillwave before chillwave existed. But, more often than not, their music has felt like a tasteful accessory, something that reminds you of other, more progressive electronic music, but mostly sounds great while trying on sweaters.\n", "Ratt": "The all-drum band Rattle's self-titled record has an admirable sense of freedom and unwillingness to mimic the tropes of conventional songwriting.\n", "Ravi": "Each Sunday, Pitchfork takes an in-depth look at a significant album from the past, and any record not in our archives is eligible. Today, we revisit 1971’s Concert for Bangladesh, an era-defining event and live album that set the template for the large-scale benefit concert as we know it today.\n", "Ray Charles": "At last available digitally, these quietly revolutionary albums still break one of music’s deepest-held genre orthodoxies.\n", "Ray J": "The second album from L.A. scenesters the Bird and the Bee sticks close to their original template, with more cool electro-exotica flecked with global pop touches.\n", "Red Hot Chili Peppers": "The longtime Red Hot Chili Peppers guitarist swaps the acid-house influences of his Trickfinger project for a loving tribute to ’90s jungle and drill’n’bass.\n", "Redman": "The id-driven hip-hop vet's long-delayed follow up to 2001's disappointing Malpractice finds him continuing to work with old friends like Method Man, Erick Sermon, and Biz Markie.\n", "Regard": "These live sets between the saxophonist and pianist capture a dialogue between two highly skilled and empathetic collaborators, whose reverence for space matches their regard for the music itself.\n", "Regina Spektor": "Regina Spektor’s latest album takes the unabashed earnestness that has always marked her music and rewrites it in a somber, minor key.\n", "Rehab": "Now reissued in expanded editions, the first official Sub Pop release—and its full-length follow-up—deserve more than historical footnote status.\n", "Rejjie Snow": "This Irish rapper's debut suggests great potential, even if he's limited for now by the obvious influence of N.E.R.D. and Tyler, the Creator.\n", "Relaxation": "The Big Thief drummer excels at creating ambient worlds, and his second release under his own name evokes the spine-tingling sensations of ASMR as well as a persistent anxiety.\n", "Remi Wolf": "The Los Angeles singer’s whole songwriting vibe is magnetic, blending future pop, bedroom pop, and funk into a new and colorful swirl. \n", "Remy Ma": "Fat Joe and Remy Ma had their biggest hit together in 2004 before last year’s comeback “All the Way Up.” On this collaborative LP, their hard styles are too similar to make for a compelling dynamic.\n", "Rene Rene": "In self-imposed exile from the international club scene, Marie Davidson teams with two close collaborators for a self-consciously odd collection of Lynchian lounge music and digitized funk.\n", "Rex Orange County": "The Dutch songwriter follows behind-the-scenes work with Rex Orange County, The Free Nationals, and others with a breezy new solo record. Featuring collaborations with Mac Demarco and Emily King, the album does a good job distilling his charms into a single package. \n", "Rhye": "Rhye leader Michael Milosh remains king of the most respectable horny music possible. His new album testifies to those talents without calling too much attention to itself.\n", "Rich Brian": "On his second album, the viral rap star makes some of the most charming music of his still-young career.\n", "Rich Homie Quan": "Quan’s official debut is a triumph of willpower and talent, a detail-oriented collection with immaculate production that rightfully reestablishes his place in rap.\n", "Rich The Kid": "The perpetual Atlanta B-lister sounds like a guest on his own albums, outshone by features from Gunna, Young Thug, Offset, Big Sean, and more.\n", "Richie Rich": "Richie Hawtin's first official studio album in over a decade finds the techno pioneer in an unusually nostalgic mode.\n", "Richter": "The composer turns to the Universal Declaration of Human Rights of 1948 for inspiration in his bittersweet new orchestral work. \n", "Rick Ross": "Age has mellowed rap’s most audacious fabulist, and on the sequel to his breakout debut, he settles into his luxe sound like a pair of velvet slippers.\n", "Rico Nasty": "On her official debut, the electric rapper-singer is by turns deliriously chaotic, full of ambition, and unfocused as she tries a little of everything that’s made her a star.\n", "Rihanna": "The new N.E.R.D. album is full of guests: Rihanna, Kendrick, Gucci, 3000, M.I.A., Wale, Ed Sheeran. They all help elevate an album that is occasionally ineffectual in its attempts at protest music.\n", "Riot": "The sprawling second album from the crystal-voiced singer-songwriter is a riot of moods. Moses Sumney widens the scope of his work and takes full account of his self, warts and all. \n", "Rise Against": "The Psalm Zero frontman and Zs alum reckons with the rise of fascism—and his internal struggle against its insidious appeal—on a debut solo album of unusually confrontational modern classical music.\n", "Rivers Cuomo": "Rivers Cuomo pays tribute to his hermit orchestral-pop heroes, name-checking Harry Nilsson, Serge Gainsbourg, and Pet Sounds. But of course, it's all Weezer in the end. \n", "Robert Glasper": "Throwing open his studio doors, the pianist aims for a loose, mixtape-like vibe, but the stacked guest list yields a scattershot party that only ends up overstaying its own welcome.\n", "Robert Miles": "Messing with Miles Davis music is a dangerous proposition. It was necessary for Don Cheadle's  biopic Miles Ahead, and with help from Robert Glasper, it's sometimes a successful endeavor.\n", "Robert Plant": "After years spent reinterpreting the work of others, lullaby sees Plant stepping up with his first batch of original songs in nearly a decade and some of the most bravely confessional writing of his career. What he’s doing here stays true to the original spirit of Led Zeppelin in a 21st-century globalized, WiFi-accelerated context, bringing together sounds archaic and modern, rustic and exotic, visceral and vaporous.\n", "Roberta Flack": "Recorded over a period of just 10 hours, the future star’s breakthrough 1969 debut captured her idiosyncratic mix of soul, jazz, and folk and her singular vision as a bandleader.\n", "Roberto Carlos": "Lange, better known as Helado Negro, teams with the visual artist Kristi Sword for a sprawling and inspired project paying tribute to the Marfa, Texas sky.\n", "Robyn": "The Swedish producer and frequent Robyn collaborator offers an ambitious three-album suite of understated, occasionally disquieting techno nocturnes.\n", "Rocky": "The Queens-based producer Alex Dadras has worked with artists as diverse as A$AP Rocky and Show Me the Body. On Holy Wind, he leaves the city behind for an otherworldly record with ecological themes. \n", "Roco": "Berlin post-rockers play nice with a member of Krautrock legends Faust and discover a looser sound.\n", "Rod Wave": "Even as the Floridian crooner becomes a breakout star, his music remains bleak and filled with pain.\n", "Roddy Ricch": "This Compton chameleon borrows flows from anyone and everyone but gets away with it thanks to his sturdy songwriting. \n", "Rodríguez": "Even as a wide-ranging, 2xCD/4xLP summary of the Mars Volta member's last decade of activity, this compilation offers only a hint of the scope of his project.\n", "Roger": "A seven-track accompaniment to the brothers’ album Mixing Colours—released as both standalone EP and digital add-on—highlights the nuances of their playing and the limits of the attention span.\n", "Romeo Santos": "The Dominican bachata king follows his chart-topping Golden with a celebration of the genre's rich history, lifting up his forebears and revealing his musical DNA.\n", "Rose": "Even as she surveys heartbreak and self-doubt, Jenn Wasner’s second solo album sounds confident. Textural layers of guitar and synth offer depth, yet allow her voice to lead the way.\n", "Roxy Music": "With cover songs and a couple of originals, this solo live performance captures the prolific Roxy Music leader in top form: the weirdo conduit for a generation’s teenage pop dreams.\n", "Roy Orbison": "The gale-force frontwoman of Shannon and the Clams collaborates with producer Dan Auerbach on a sparkling debut solo album that sounds like Roy Orbison lost in the Brill Building.\n", "Royal Blood": "This Brighton bass-and-drums duo have swiftly become the most universally deified emergent UK rock band since the Arctic Monkeys first thawed out eight years ago. But by using their muscular might to prop up otherwise featherweight tunes, Royal Blood have effectively built themselves a castle and furnished it with IKEA.\n", "Rudimental": "London dance-pop quartet Rudimental earned a #1 British debut on the heels of two chart-topping hits, \"Feel the Love\" and \"Waiting All Night\". Their debut album's dozen tracks are stuffed to the brim with disparate parts and unfold in unexpected ways.\n", "Run The Jewels": "On their fourth installment, Killer Mike and El-P are back to tune up the ruling class and the racist police state, this time streamlining the process and settling into their most natural rhythm.\n", "Run–D.M.C.": "Expanded reissues of the hip-hop legends' first four albums.\n", "Rush": "Channeling sugar-rush synths and bracing noise, the Philadelphia producer continues his quest to make pop music stranger and more head-spinning—and to test listeners’ ability to follow the twists and turns.\n", "Russ": "The New York electronic musician fashions an evocative tribute to Ursula K. LeGuin’s 1969 novel The Left Hand of Darkness, conjuring the flux of gender and desire in shape-shifting sounds.\n", "Ruth B.": "On their collaborative debut, the Louisiana sludge band and the Kentucky songwriter funnel gothic majesty and charred metal into moments of unlikely wonder.\n", "Ryan Adams": "Ryan Adams’ new album is being positioned as one of his classic breakup records. In terms of its sound, at least, it's a winner.\n", "Ryan R": "Against dry, plucked guitar and minimal piano, the Texas songwriter creates moments of intimacy that always seem to suggest more than he’s willing to say outright.\n", "Ryn Weaver": "Ryn Weaver's first single, \"OctaHate\", which she co-wrote with Charli XCX, has racked up millions of plays since she posted it to SoundCloud just over a year ago. Her debut album, The Fool, which was produced by Benny Blanco and Passion Pit’s Michael Angelakos,  doesn’t seem to know what to do with \"OctaHate\"’s momentum.\n", "Ryuichi Sakamoto": "Released shortly before his group Yellow Magic Orchestra’s historic debut, the Japanese synthesizer icon’s first solo LP balances kitsch, complexity, and a critical geopolitical perspective.\n", "RÄD": "Black Bananas boasts the same personnel as Jennifer Herrema's other post-Royal Trux band, but she fashions it as an alternate-universe RTX, one that isn't afraid to absorb modern influences like synth-pop, hip-hop, French-touch house.\n", "Röyksopp": "Though the Norwegian duo Röyksopp aren't calling it quits, Torbjørn Brundtland and Svein Berge have billed their new album as their last in the \"traditional album format.\" The Inevitable End is devoted to glossy, bittersweet electronic drifts featuring guest vocals from the likes of Robyn and others.\n", "RŮDE": "The Chicago-bred, now Brooklyn-based beatmaker DJ Rude One’s ONEderful is a grubby set of blood-in-your-mouth street raps, featuring Roc Marciano, Your Old Droog, Mr Muthafuckin eXquire, and more.\n", "S Club 7": "Summer Walker’s follow-up to her 2019 debut album offers a quick tour through the Atlanta singer’s world—a couple sultry strip club joints, a couple guitar-led ballads, and a playful reunion with PARTYNEXTDOOR.\n", "SAINt JHN": "After an illegal remix made him a TikTok hit, the Brooklyn rapper-singer struggles to create an identity on his new album,  enlisting high-profile guests like Kanye, Lil Uzi Vert, and Future in the effort. \n", "SALES": "On their second record, the Orlando duo create a world of cozy, minimalist pop.\n", "SEVENTEEN": "Seventeen months since his release from prison, Gucci Mane delivers one of his most consistent and accessible releases in years, and a prime showcase for his renewed charisma.\n", "SG Lewis": "The British producer’s detailed yet frictionless house bangers are full of reverence for the dancefloor, though too controlled to match its catharsis.\n", "SHAUN": "On his third release as the genre-bending alter ego Diane Coffee, Shaun Fleming explores the trap of online intimacy.\n", "SIAMES": "I really never saw Shannon Selberg as the poster boy for anything, aside from maybe one of the nastier forms ...\n", "SLANDER": "The legend of 13th Floor Elevators leader Roky Erickson is one of the most compelling in rock. His brilliant 1981 solo collection The Evil One is getting a fresh coat of paint as part of a trifecta of Erickson reissues, along with Don’t Slander Me and Gremlins Have Pictures, both from 1986. Erickson’s place in the pantheon of outsider art isn’t in question. The best thing about these reissues, though, is how accessible Erickson actually is.\n", "SMO": "The Detroit rapper's second mixtape of the year is like a compilation of leftovers, with enough meticulously told tales to justify the experience.\n", "SOB X RBE": "The Bay Area rap crew’s collaboration with Hit-Boy catches them in a moment of furious flux.\n", "ST": "Snoop’s new album, the latest in a quietly prolific period as he closes in on 50, reminds of the simple pleasures of his still-virtuosic voice when set against booming, funk-inflected production.\n", "STRFKR": "The usually chirpy Portland, Oregon synth poppers take a lyrically dark turn on their fourth album, where frontman Josh Hodges sings about his fear of death, restless nights, romantic tragedy, and emotional crisis.\n", "SYML": "Carissa’s Wierd alum makes her first foray into crowd-pleasing synth pop in an intriguing collaboration with Seattle-based producer SYML.\n", "SZA": "The long-awaited debut from the Jersey singer is an opulent, raw R&B album that constantly tests the borders of the genre. SZA’s deeply personal lens on modern romance gives these songs endless life.\n", "Saba": "The grief-stricken Chicago rapper’s latest is a marvel of craft, musicality, and emotion. Through Saba’s inner turmoil, he finds his most powerful and diaristic storytelling.\n", "Sabb": "Made in L.A. under the influence of colossal amounts of cocaine, the heavy metal legends’ fourth album, recently reissued, made room for both light and shade and featured several of their signature songs.\n", "Sada Baby": "Lil Yachty consummates his unlikely relationship with Michigan rap on a mixtape pairing him with mainstays like Sada Baby and Rio da Yung OG.\n", "Sade": "Today on Pitchfork, we are taking a critical look at the UK band Sade—from quiet storm mainstays to defining a generational vibe—with new reviews of four of their records\n", "Sage The Gemini": "Sage the Gemini of the Bay Area’s Heartbreak Gang collective has refined a sound that draws influence from frenetic dance-informed NorCal hyphy music and L.A. jerk music, with hints of the sleek “crunk&B” of Jazze Pha and Ciara. His chart-placing instructional dance floor drills are presently his livelihood, so his debut album Remember Me arrives with a mission: keep listeners on their feet, but show some range.\n", "Salt-N-Pepa": "Salt-N-Pepa laid out their best music and bravest activism on Very Necessary, an album about love, agency, and take-no-shit femininity from the Queens rap trio.\n", "Sam Hunt": "The Nashville star blends genres with charm and style on his first new album in five years, a marker of what modern commercial country can do at its heights.\n", "Sampha": "The new project from the head of XL Recordings features collaborations with Sampha, Kamasi Washington, and Ghostface Killah’s son.\n", "Santana": "Dipset were always a theater of the absurd. On their first album in more than a decade, Cam’ron, Juelz Santana, and Jim Jones become a trio of almost no effort.\n", "Santigold": "The singer’s latest mixtape is soulful, summery, and without borders. Thanks in part to the production of Mixpak’s Dre Skull, Santigold commits to a careful interpolation of the dancehall sound.\n", "Sarah McLachlan": "The Canadian singer-songwriter’s third record is a fascinating outlier in her catalog, an unsparing and expansive album written in the mountains of Quebec following traumatic experiences in her life.\n", "Savage": "The sequel to the canonical Atlanta mixtape is meant to be a legacy-defining stamp, but despite all its glossy guest stars (Morgan Freeman!), it never rises above “just fine.”\n", "Saweetie": "The “ICY GRL” rapper’s debut EP is a low-stakes but gratifying listen, full of witty one-liners and cheeky quotables.\n", "ScHoolboy Q": "The L.A. rapper’s latest is comforting if not entirely exciting. It finds Q and host of guests in a good place with nothing to prove.\n", "Scarface": "Each Sunday, Pitchfork takes an in-depth look at a significant album from the past, and any record not in our archives is eligible. Today, we explore Scarface’s deathly personal 1994 solo album.\n", "Scissor Sisters": "The Scissor Sisters frontman’s solo debut could’ve been a disaster: A pop star moseys down to New Orleans to find “real music.” But if you’re not a stickler for authenticity, it’s actually irresistible.\n", "Seal": "After 10 years and an aborted Dr. Dre collaboration, the legendary MC releases his comeback album.\n", "Sean Paul": "Each Sunday, Pitchfork takes an in-depth look at a significant album from the past, and any record not in our archives is eligible. Today, we revisit the arrival of Sean Paul, who brought dancehall with all its complexity to the masses.\n", "Selena Gomez": "Selena Gomez’s third album is a smooth and confident pop record that delves deep—but not that deep—into heartbreak, resilience, and self-love. \n", "Sensation": "On their first new album in four years, the Irish punk quartet channel pure, visceral panic through screeching sensory assaults and scrap-metal clang.\n", "Sepultura": "Machine Messiah skirts the line between metal and conventional “hard rock” more than anything in the Sepultura catalog.\n", "Serge Gainsbourg": "Singing about human complexity, channeling her past with Serge Gainsbourg, and grappling with the death of her daughter, the iconic singer-songwriter sounds battle-scarred but never defeated.\n", "Set It Off": "The Toronto rapper’s debut shows off his ridiculously catchy melodies and distinct persona, even as it moves within templates set by his peers.\n", "Sex Pistols": "This bootleg-- first issued surreptitiously in the months before the release of Never Mind the Bollocks-- features more than a dozen demos from 1976-77.\n", "Shadow": "As the Cleveland band returns to Electrical Audio at full force, they retain their penchant for rueful concision and world-weary chronicles of pandemic existence.\n", "Shaggy": "On their second album and first for Sub Pop, the Canadian indie rock group pairs shaggy guitars with sardonic observations. \n", "Shakira": "Each Sunday, Pitchfork takes an in-depth look at a significant album from the past, and any record not in our archives is eligible. Today, we revisit Shakira’s big crossover record that revealed her fascinating, idiosyncratic songwriting and created a rift among her fans.\n", "Shama": "Latest Jagjaguwar release from the prolific Glaswegian free music maverick.\n", "Shane & Shane": "On her debut LP, the young Atlanta rapper and singer avoids guests and try-hard hits while embracing a voice that runs like water.\n", "Shania Twain": "The enigmatic masked country singer follows up his debut with more songs about lonesome souls alone together—and one standout duet with Shania Twain.\n", "Sharon Van Etten": "Sharon Van Etten invites a handful of artists to cover songs from her 2010 album epic. These new versions—played by Fiona Apple, Lucinda Williams, and more—reveal the music’s healing power and complexity.\n", "Shawn Mendes": "The pop heartthrob’s lovestruck fourth album comes across like your friend who just got into a relationship and won’t shut up about it: You’re happy for them and also tremendously bored.\n", "Sheck Wes": "Sheck’s raw and unruly debut is a force to be reckoned with, a coming-of-age album from an über-hyped prospect that actually delivers on its promise.\n", "Sheff G": "The boisterous rapper’s latest is mellower and more muted than its predecessor, breaking from the maximalist bluster of conventional Brooklyn drill.\n", "Sheryl Crow": "On this covers EP, the country singer digs into the roots in some of her favorite dark love songs, from Sheryl Crow to Nick Lowe to Hank Williams.\n", "Shordie Shordie": "The Baltimore rapper continues to earn his “Captain Hook” nickname on an album full of Murda Beatz’s sometimes too-spare production. \n", "Shoreline Mafia": "The buzzing L.A. rap group flattens some of its personality with its major-label debut, a mix of party cuts and bland compromises. \n", "Shy Glizzy": "As with all of his best work, the D.C. rapper’s latest finds him grappling with trauma, haunted by the specter of death at every turn.\n", "SiR": "Sir Paul presents a resequenced, alternate-universe version of last year’s trilogy-completing release, as performed by Beck, Phoebe Bridgers, St. Vincent, Dev Hynes, Damon Albarn, and more.\n", "Sia": "Diplo, Sia, and Labrinth combine forces for an album of truly forgettable pop music that is too tired to be wired.\n", "Sigur Rós": "The Icelandic post-rockers waver between exuberance and heavy-handed melodrama on the first official recording of an 18-year-old operatic work based on a centuries-old medieval poem.\n", "Silverstein": "Shel Silverstein’s reputation rests on his children’s books, but he also had a long, illustrious songwriting career in Nashville. No one performed his ribald, irreverent songs more than the progressive country singer Bobby Bare, and this box set collects their work.\n", "Silversun Pickups": "For a rock band who excels at high-intensity drama, their latest is set of mid-tempo snoozers that are over-refined, hermetically sealed, and safe.\n", "Simon & Garfunkel": "Featuring Simon & Garfunkel’s studious folk and the easy listening of Dave Grusin, a new vinyl reissue attests that what makes a fascinating artifact does not always make for an especially good listen.\n", "Simple Minds": "\n\n", "Sinéad O'Connor": "Sinead O'Connor's latest album is much more musically adventurous, not to mention more lyrically ambitious, than 2012’s How About I Be Me (And You Be You)?; it’s also a bit more self-conscious, which means it never packs the same punch as its predecessor. Still, she continues to lay claim to every musical possibility and refuses to define herself with only one particular style.\n", "Sister Sledge": "The latest in a long line of box sets and anthologies collects the pioneering disco duo’s core albums. Despite the songs’ deep familiarity, they still represent pop at its most triumphant and complex.\n", "Skepta": "Three years after he galvanized a new class of UK rappers, the grime MC tries to meet the high bar he set for himself.\n", "Skid Row": "After producing a convincingly jittery, grimy portrait of late-Bloomberg New York on 2013’s NYC, Hell 3:00 AM, experimental producer/composer James Ferraro has accomplished a similar likeness of his adopted hometown Los Angeles with Skid Row. It should come as no surprise that it's short on sunshine and mellow vibes, and long on looming existential dread.\n", "Skrillex": "The Los Angeles singer-songwriter’s music gets a beat-oriented makeover in a collection of remixes from Skrillex, Omar S, Lafawndah, and other club producers.\n", "Sky": "Lange, better known as Helado Negro, teams with the visual artist Kristi Sword for a sprawling and inspired project paying tribute to the Marfa, Texas sky.\n", "Slayer": "Though led by a fiery performance from Mike Patton, this Slayer/Retox/the Locust supergroup doesn’t shed much new light on the players involved.\n", "Sleep": "Yo La Tengo’s second EP in recent months finds them resuming their covers jukebox niche, weaving together selections as unlikely as a 1940s blues oddity and as recognizable as a Bob Dylan classic.\n", "Sleepy Hallow": "On his new solo mixtape, the Flatbush rapper spits with the kind of ease and flash that starts block parties.\n", "Slim Jxmmi": "The triple album from Slim Jxmmi and Swae Lee is their clearest personal statement yet, a shining triptych of what it looks like to be young, black, and euphoric.\n", "Slim Thug": "The latest compilation from Young Thug’s YSL label is packed with appearances from rap’s biggest stars, though its flamboyant host seems content to take a backseat.\n", "Slipknot": "The sixth album from the Iowa metal mainstays has more to offer than expected and is still sometimes frustratingly short-sighted.\n", "Sloan": "The Canadian power-pop veterans' eleventh studio album and first in three years pays titular homage to both the band’s Canadian heritage and their democratic songwriting partnership. It also manages to break new ground, which is no small feat when considering that they’ve been at this for a quarter-century.\n", "Slowdive": "The shoegaze legends return with their first album in 22 years, a precise and altogether gorgeous showcase of their peerless ability at production, mood, and songcraft.\n", "Sly & The Family Stone": "This four-disc set captures several shows by Sly and the Family Stone at New York's Fillmore East. It is the document we've been missing of the onstage Family Stone of legend: the tightly knit extended family that sang and played together, the group that magically united black and white audiences.\n", "Smash Mouth": "A little Gary Glitter, a little Kid Rock, even a little Smash Mouth—the third album from these former California party kids holds nothing back.\n", "Smino": "The second album from the Chicago MC is lighter and more fun than his debut, focusing on his incredibly versatile voice within a warm palette of sludgy R&B and neo-funk.\n", "Smith": "Steeped in Acadian musical heritage, the Louisiana songwriter’s sketchy four-track recordings and odd, dreamy storytelling evoke the likes of Jessica Pratt or Elliott Smith.\n", "Smokepurpp": "Lil Pump’s wingman goes through the motions on an aimless, half-baked new 10-song mixtape with “Nice for What” producer Murda Beatz.\n", "Snoh Aalegra": "On the sequel to 2017’s FEELS, the Iranian Swedish singer’s dramatic take on soul finally bears fruit.\n", "Snoop Dogg": "Snoop’s new album, the latest in a quietly prolific period as he closes in on 50, reminds of the simple pleasures of his still-virtuosic voice when set against booming, funk-inflected production.\n", "Snow Patrol": "The Irish modern-rock producer, best known for his work on records by U2, Snow Patrol, and Kasabian, opts for an idiosyncratic electronic melange featuring a surprising roster of guests.\n", "Snøw": "The Irish modern-rock producer, best known for his work on records by U2, Snow Patrol, and Kasabian, opts for an idiosyncratic electronic melange featuring a surprising roster of guests.\n", "SoMo": "The Boston rockers’ third album wears its radicalism with confidence, and the untimely death of the band’s guitarist lends their late-capitalist protest unfortunate urgency.\n", "Solange": "The Los Angeles pianist, a collaborator of Solange and Frank Ocean, sinks back into spare soul-jazz and meditative new age, occupying a middle ground between deep and easy listening.\n", "Solo": "The Wand frontman’s second solo record blows open the chamber pop of his first for a lysergic and unsettling take on cosmic Americana.\n", "Sonder": "Blending UK bass, deconstructed techno, and abstract ambient, the Bristol producer crafts stripped-back club tracks distinguished by their crystalline sound design and icy atmospheres.\n", "Sonic Youth": "Three years before they split, at an Independence Day concert in a downtown park, the band tore through its earliest work with the polish of seasoned pros.\n", "Sono": "On his third and final album as SONOIO, Alessandro Cortini of Nine Inch Nails combines the brooding intensity of Trent Reznor’s band with arena-rock melodies in the vein of U2 and Depeche Mode.\n", "Soulja Boy": "Soulja Boy just isn’t able to capitalize on his recent goodwill with some worthwhile new music.\n", "Sound Rush": "On his fourth album, Kevin Parker takes a breath and eases into a smoother psychedelic sound. Even without the adrenaline-filled highs, the compositions are as rich and thoughtful as ever.\n", "Soundgarden": "This focused and forceful 2013 live set showed the reunited grunge band looking to their future before the tragic death of lead singer Chris Cornell.\n"}