{"Space": "Featuring co-production from Kurt Vile, the classic trio’s latest reunion album is their breeziest and most melodically generous yet.\n", "Sparks": "Led by 19-year-old Jana Bahrich, the fiery emo duo tackle big existential questions and turbulent emotions in four short songs that throw off promising sparks of brilliance.\n", "Spice Girls": "Each Sunday, Pitchfork takes an in-depth look at a significant album from the past, and any record not in our archives is eligible. Today, we revisit the sleek pop, British nationalism, and commercial girl power of the Spice Girls’ debut.\n", "Spoon": "The Russian duo’s frenetic approach is more techno egg-and-spoon race than tech-house marathon, packed with improbable sounds, intriguing blind alleys, and eyebrow-raising quirks.\n", "St. John": "Working with John Congleton, the folk trio makes their most personal and energetic statement yet, sacrificing some of their clarion intimacy along the way. \n", "St. Vincent": "Sir Paul presents a resequenced, alternate-universe version of last year’s trilogy-completing release, as performed by Beck, Phoebe Bridgers, St. Vincent, Dev Hynes, Damon Albarn, and more.\n", "Stars": "The latest compilation from Young Thug’s YSL label is packed with appearances from rap’s biggest stars, though its flamboyant host seems content to take a backseat.\n", "Starship": "19-year-old Ryan Kidwell suffers from a textbook Jekyll-and-Hyde complex. By day, mild-mannered Mr Kidwell leads a typical adolescent lifestyle, attending ...\n", "Statik Selektah": "Statik Selektah, a hip-hop mainstay, brings Action Bronson, Joey Bada$$, Raekwon, Prodigy and more for a boppy, East Coast delight that doesn't make the best use of the producer’s intuition.\n", "Status Quo": "The Berlin producer is unafraid to throw a wrench into her steady grooves, and her latest disregards clubland’s status quo for more imaginative terrain.\n", "Steely Dan": "Today on Pitchfork, we are taking a critical look at Steely Dan—from their early classic rock staples to their latter-day studio sleaze—with new reviews of five of their most influential records.\n", "Stereophonics": "We'd love to say that the latest album from this plodding band, out last year in the UK and just now being released stateside, is a surprising career renaissance. However...\n", "Steve Aoki": "Steve Aoki’s latest EP, 4OKI, is a cheap, placebo imitation of a party.\n", "Steve Earle": "On this poignant covers album, Steve Earle inhabits his late son’s songs of love and loss as a means of moving through pain.\n", "Steve Lacy": "The singer and guitarist’s debut solo album offers an introspective blend of R&B, hip-hop, & lo-fi pop but feels reluctant to claim the spotlight.\n", "Stevie Nicks": "The superstar’s eleventh studio album pairs her with famous friends ranging from Stevie Nicks to St. Vincent.\n", "Sticky Fingers": "Sticky Fingers came at a time when—on record, at least—the Rolling Stones could do no wrong. This album could reasonably be called their peak. They were called the World's Greatest Rock'n'Roll Band for entirely too long, but if that designation ever applied, it was here.\n", "Sting": "On her breakthrough project, executive produced by Phonte, the polymath rapper-singer displays her love of classic hip-hop and tries to soothe the sting of survivor’s guilt. \n", "Storm": "Each Sunday, Pitchfork takes an in-depth look at a significant album from the past, and any record not in our archives is eligible. Today we revisit Anita Baker’s timeless 1986 album, a slow-burning and symphonic piece of quiet storm R&B that floods every sense.\n", "Stunna 4 Vegas": "DaBaby’s hypeman manages to make money sound boring on his first solo outing. \n", "Sturgill Simpson": "Accompanied by some of the best players in the scene, the country maverick performs bluegrass versions of highlights from his back catalog, revealing the hidden roots of his idiosyncratic songwriting.\n", "Styles": "Now on his own label, the internet rap originator explores all his favorite styles—warbling rap, theatrical rock and pop—and the results are consistently joyous. \n", "Styles Of Beyond": "Moving beyond FAKA’s gqom influences, the South African musician pairs experimental club styles with operatic falsetto in a multi-sensory exploration of the nature of the divine.\n", "Styles P": "Now on his own label, the internet rap originator explores all his favorite styles—warbling rap, theatrical rock and pop—and the results are consistently joyous. \n", "Sublime": "Each Sunday, Pitchfork takes an in-depth look at a significant album from the past, and any record not in our archives is eligible. Today, we revisit the devastating and sublime debut from one of the most outstanding voices and songwriters in country music.\n", "Sueco": "The 22-year-old Instagram stuntman turned TikTok sensation has been minorly famous for only a few months, but he already sounds washed up.\n", "Sufjan Stevens": "Fusing early music, ambient, and folk, the Czech couple’s work has entranced fans like Sufjan Stevens and Bryce Dessner for decades. This collection is an enchanting portal into their furtive soundworld.\n", "Sugababes": "", "Sugarland": "No Wave-inspired band makes its Rare Book Room debut, bringing an increase in clarity and detail to its thick noise.\n", "Summer Salt": "Martyn Bates and Peter Becker continue to explore outside typical genre boundaries, offering an accessible and enveloping record that's in pace with their largely unrecognized output over the past three decades.\n", "Sun": "Departing from the high-impact electro of his Galaxian alias, Scottish producer Mark Kastner explores more contemplative strains of ambient and IDM.\n", "Sunshine": "The Buffalo rapper’s new project is another serving of glamorous beat loops and gaudy raps delivered with the confidence of someone who believes that all of their thoughts belong in the MoMA.\n", "Supergrass": "Britpop's most flat-out enjoyable band continue to learn to age gracefully, here working with Bad Seeds producer Nick Launay, who showcases a harder yet still familiar image of the group.\n", "Surf Curse": "The beachy post-punk duo are at their most confident on their third album, with a sense of anguish that brings emotional depth to otherwise plain lyrics.\n", "Surfaces": "The UK trio’s first album since 2011 finds new life in the smooth surfaces of house music.\n", "Survivor": "The pop survivor shows off her powerhouse voice, dabbles in try-hard slang, and takes tentative steps toward creative rebirth on her first album since 2012.\n", "Swae Lee": "The triple album from Slim Jxmmi and Swae Lee is their clearest personal statement yet, a shining triptych of what it looks like to be young, black, and euphoric.\n", "Swizz Beatz": "The New York producer’s second album is a showcase not only for the marquee guests but for Swizz’s talent as a great arranger and knowing when to step out of the way.\n", "Syd": "The funky retro-soul band aims to set itself apart from leader Anderson .Paak on a solo debut packed with guests, including Syd, Kali Uchi, and the late Mac Miller.\n", "Syke": "Jesse Sykes & the Sweet Hereafter's fourth album favors oddly shaped jams and is their heaviest to date.\n", "Sylvan Esso": "After the ascent of her electronic-pop duo Sylvan Esso, Amelia Meath reassembled her old vocal folk trio for a surprise second album—a charming reflection on age, friendship, and play.\n", "Symphony Orchestra": "The all-star collaboration between a producer, a saxophonist, and a symphony is a celestial event. But it’s Pharoah Sanders’ playing that holds it all together, a clear late-career masterpiece. \n", "System Of A Down": "Each Sunday, Pitchfork takes an in-depth look at a significant album from the past, and any record not in our archives is eligible. Today, we revisit a slice of hyperactive, politicized nu-metal from 2001.\n", "T-Pain": "Melding disco extravagance with Old Hollywood glamour, the Los Angeles duo’s lush, shape-shifting glam rock transcends pastiche with theatrical flair.\n"}