{"Daniel Caesar": "The Toronto singer croons his way into a sapiosexual world of love and philosophy, though not without controversy.\n", "Danny Brown": "On his fifth album, executive-produced by Q-Tip, Danny Brown ascends to a sort of hip-hop classicist nirvana and remains one of the most inventive and dimensional rappers working today.\n", "Danzig": "On the third album he made with his biggest band, Glenn Danzig lived up to his larger-than-life metal-god myth in ways he’s rarely done since.\n", "Dashboard Confessional": "The emo lifer’s seventh album tries to balance intimacy and accessibility, but he only ends up with the latter.\n", "Daughter": "Singing about human complexity, channeling her past with Serge Gainsbourg, and grappling with the death of her daughter, the iconic singer-songwriter sounds battle-scarred but never defeated.\n", "Dave Matthews Band": "On what may seem like a readymade gag, the psych-folk favorite covers the lost Dave Matthews Band album in full. He convincingly connects his adolescent love to his adult explorations.\n", "David Bowie": "A new boxed set documents Iggy Pop’s formative years working alongside David Bowie in Berlin, the moment Pop left the sound of the Stooges behind and came into his own as a lone icon.\n", "David Gilmour": "Over the past few years, the Orb have been nudging their sound back toward its techno-hippie roots; now they team with Pink Floyd's David Gilmour (!).\n", "David Gray": "The UK singer-songwriter’s 1998 album remains a phenomenon that defies explanation: a modest collection of love songs recorded in his bedroom by an Everyman who was suddenly Everywhere.\n", "Dax": "On his debut solo album, the Oakland experimental musician utilizes custom-built software systems that allow him to navigate around disability, with electrifying results.\n", "Daz Dillinger": "Cuzznz is an album-length collaboration between Snoop Dogg and Daz Dillinger, real-life cousins who have never stopped recording together despite Daz's lower profile. Several songs on the album are produced by Dâm-Funk.\n", "De Bos": "The shadowy Bay Area quartet combine black metal with shoegaze, post-hardcore, screamo, and even indie rock on their chaotic, aggressive sophomore collection, their first for Profound Lore.\n", "De La Ghetto": "The L.A.-based DJ duo Nadastrom follow a self-titled debut from earlier this year with a breezy, sneakily deep mixtape built around samples from an early episode of The Fresh Prince of Bel Air. In that episode, Will joins a poetry club and, in order to impress women, invents a \"street poet\" named Raphael De La Ghettó.\n", "De La Soul": "Each Sunday, Pitchfork takes an in-depth look at a significant album from the past, and any record not in our archives is eligible. Today, we revisit the groundbreaking 1989 debut album from hip-hop legends De La Soul.\n", "DeJ Loaf": "Dej Loaf is the rap equivalent of a well-executed eye roll—simple, excellent viciousness. All Jokes Aside is a record full of nonchalant barbs. Men and/or those messing with her money: watch out.\n", "Dead Kennedys": "Reissue of the debut LP from Jello Biafra's agit-punk group.\n", "Dead Or Alive": "Jadakiss's first LP in over six years features Jeezy, Puff Daddy, Future, and others. At a point in his career when he should be completely free from commercial expectations to make whatever music he wants, one of the world's best and most frustratingly aimless rappers ends up in the same no-man's land he always does.\n", "Dean Martin": "On its sixth album the indie pop band explores wide-open, arid spaces and increasingly darker territory.\n", "Death Cab for Cutie": "Splitting the difference between War on Drugs and Death Cab for Cutie, the latest from the Brooklyn band offers indie rock at its most familiar and instantly gratifying.\n", "Death Grips": "The prolific noise rap project drills down on their sonic signature and remains politically agnostic and persistently agitated.\n", "Declan McKenna": "Nodding to Bowie and the Beatles on songs about climate change and capitalism, the 21-year-old songwriter roots his political critique in the rich tradition of British protest rock.\n", "Deftones": "Deftones’ ninth album reaches for a plane beyond loud and quiet, where the band is free to indulge its harshest and most gentle impulses at once. For the first time, they make it look easy.\n", "Demi Lovato": "After an overdose nearly ended her life, Demi Lovato sings powerfully and directly about her past and who she wants to become.\n", "Denzel Curry": "The duo’s refurbished EP gets the typical sequel treatment, with new characters and a glossy finish that makes you miss the gritty original.\n", "Depeche Mode": "Availing himself of his formidable array of modular-synthesizer components, the Depeche Mode songwriter indulges his darkest instincts.\n", "Desiigner": "The 21-year-old Kanye West acolyte and Future soundalike tries again to step out of his elders’ shadows on an EP that is unlikely to quiet his critics.\n", "Destiny's Child": "Beyond its tabloid drama, the innovation of Destiny’s Child’s second album codified the sound of R&B at the turn of the millennium. It is stilletto-sharp, and laid the groundwork for Beyoncé’s career.\n", "Deuter": "The A-Frames' Lars Finberg branches out and offers his tidiest, most civilized work-- even if it still (thankfully) retains most of his signature post-punk bile.\n", "Devendra Banhart": "On his most cohesive album in more than a decade, the re-energized songwriter imparts life lessons to the child he may never have.\n", "Dexys Midnight Runners": "30th anniversary reissue of Dexys' debut album chronicles the first of four distinct versions of the band led by the ferocious perfectionist Kevin Rowland.\n", "Dido": "The UK goddess of lite pop still sounds serene, unbothered, and preternaturally confident.\n", "Die Antwoord": "Across the South African rap duo's fourth album, their iconoclastic rave-rap fades into shallow humor and belabored production.\n", "Dillon Francis": "Money Sucks, Friends Rule is Dillon Francis' first full-length after a string of EPs and singles that broke moombahton big in the States. And while there've been glimpses of what he can pull off, his intended breakout suffers from a lack of nuance.\n", "Dion": "Pairing a world’s worth of traditional instruments with widescreen gestures, the legendary duo explore the myth of a Greek god in an unknown tongue.\n", "Diplo": "Trickled down from the success of “Old Town Road” and the meme-level pervasiveness of the yeehaw agenda, the ubiquitous producer’s purported country album suffocates in treacly kitsch.\n", "Dire Straits": "As heard on this 6xLP box set, the UK classic rockers were artier than their reputation suggests, with a subdued sense of adventure that propelled the group throughout its career.\n", "Dirty T": "Dirty Projectors are once again a group effort. Their new EP is helmed by singer Felicia Douglass, whose smooth voice is an antidote to Dave Longstreth’s ceaselessly complicated arrangements.\n", "Disciples": "Hard punk from Florida doesn’t get much bloodier than this—22 minutes of loud, incredibly catchy songs that revel in mythological and contemporary scum and violence.\n", "Disclosure": "The Lawrence brothers’ third album of glossy yet gritty disco pop suggests that their true lineage is the Y2K chart-house sound once ubiquitous on UK airwaves.\n", "Dispatch": "On his latest sorrowful dispatch, the drill veteran walks the line between reporter and preacher, gangster and citizen.\n", "Divine": "The experimental rapper from Richmond, Virginia raps, speaks, and sings over a strange amalgamation of beat sculptures, glitchy melodies, and found audio. The effect is dizzying and alluring. \n", "Doja Cat": "On her first full-length release since her viral breakout, the rapper-singer and songwriter proves that her real gift is her versatility.\n", "Dolly Parton": "RCA reissues three of the most well-loved albums of the country legend's career-- adding bonus tracks and doing remastering work on each.\n", "Dominic Fike": "The rising 24-year-old Florida rapper surfs affably on TikTok trends and sounds exactly like a label executive’s idea of the future. \n", "Don Omar": "On Omar S's second self-released album-- the rare techno/house album that feels inimitably of its own time-- the Detroit native remains refreshingly uninterested in the unspoken pissing contest that is every producer's attempt to make the \"deepest\" record in any given DJ crate.\n", "Don Toliver": "The melodic Texas rapper attempts to step out of Travis Scott's shadow with a debut that mimics Scott at every turn. \n", "Donna Summer": "As a descriptive signifier, the term IDM never made much sense to me. Playing-up the reclusive-genius schtick to such an ...\n", "Dope": "The Detroit rapper’s standout debut is among the year’s most engaging rap albums so far, packed with disarming metaphors, humor, and introspection.\n", "Doris Day": "The eccentric singer-songwriter pays tribute to the music of Doris Day, from classics like \"Sentimental Journey\" to lesser-known songs from films.\n", "Dr. Dog": "After years of recording and quietly releasing beatific folk music, the Bay Area singer/songwriter flexes her voice and vision on pop songs of complicated feelings and private anxieties.\n", "Dr. Hook": "New York’s most anxious punk delivers hook after hook on an album that deals with evergreen sociopolitical concerns yet sounds like it could’ve been written 30 minutes ago.\n", "Drake": "Drakeo’s second project of all-new material since being released from prison is more relaxed and less bitter than his first. There’s a subtext to every flex; he’s been through the wringer, and this is his time to celebrate.\n", "Drama": "The Iceland-based composer’s score for the Arctic crime drama shivers with ominous uncertainty that’s better appreciated in its original context.\n", "Dre": "Manchester producer Evan Majumdar-Swift mines the history of club music for slippery, enigmatic electro jams that move in unexpected directions, sounding melancholy yet playful.\n", "Dream Theater": "Spacemen 3’s newly reissued drone album—recorded in 1988 in the lobby of a movie theater—marked the start of the curious rise of one of the UK’s most influential indie rock bands.\n", "Dreamville": "The octet’s latest group project, full of vibrant theatrics and polished posse cuts, is at times representative of Dreamville Records’ reductive homages. \n", "Dreezy": "After a quiet few years following her 2016 studio debut, the Chicago rapper returns sounding self-assured, wrapping her sharp flow in lush yet punchy beats.\n", "Dua Lipa": "Packing 15 producers into 50 minutes, the fun but overstuffed Future Nostalgia rework hopscotches between piano house, Baltimore club, and the kind of dance remixes that power Chelsea gay bars.\n", "Duke Dumont": "Seven years after his breakout hit, the UK house producer’s debut album aims to bridge generation-defining dance sounds with more emotive electronic fare, but mostly struggles to find its way.\n", "Duran Duran": "The singer-songwriter and pianist writes quietly epic songs about heartbreak, determination, and loneliness.\n", "Dustin O'Halloran": "The neoclassical-ambient duo of Adam Wiltzie and Dustin O’Halloran offers a gorgeous, towering, and apposite score for a dance theater production based on the Italo Calvino novel of the same name.\n", "Dusty Springfield": "Featuring most the magisterial Dusty in Memphis and its lesser follow-up A Brand New Me, plus a bevy of related tracks, a new collection captures one of pop’s most fascinating personalities in her second act.\n", "Dyl": "Six decades into his career, Bob Dylan delivers a gorgeous and meticulous record. It is the rare Dylan album that asks to be understood and comes down to meet its audience.\n", "E-40": "On his latest double album, the Vallejo vet remains free-flowing, wise, hilarious, and unstoppable.\n", "EARTHGANG": "The debut album from Spillage Village founders Olu and WowGr8 is a whimsical, theatrical attempt to capture the inexhaustible magic of Atlanta.\n", "EL": "Nick Cave’s cinematic work with his bandmate Warren Ellis is a slight departure from last decade’s trilogy of albums. It’s defined by its stark contrasts, at turns brutal, surreal, and romantic.\n", "ELISA": "About half of Magik Markers frontwoman Elisa Ambrogio’s solo debut suggests low-budget renditions of tracks meant for bigger spaces and studios. But she comes from a lineage of punk pranksters and art-rock iconoclasts, musicians who’d rather destroy a song altogether than see it played too straight.\n", "ERA": "Each Sunday, Pitchfork takes an in-depth look at a significant album from the past, and any record not in our archives is eligible. Today we revisit the influential debut from the SoCal band, a pop-punk spark that spread like wildfire in the Tumblr era.\n", "Eagles": "Josh Homme's band with Jesse \"the Devil\" Hughes returns with another album of sleazy and entertaining rock'n'roll. But Zipper Down’s tongue-in-cheek humor belies the dark self-awareness of two guys well-versed in the study of human depravity.\n", "Earl Sweatshirt": "The Earl Sweatshirt collaborator’s curated, understated mixtape fits a wealth of words into a small space. Even when rapping, he thinks like a producer, as concerned with texture as he is with text.\n", "Eazy-E": "The Oakland rapper’s quarantine album is meant to portray a radically different artist. More often, he just finds new ways to telegraph the same stories he’s told all along.\n", "Echo & the Bunnymen": "For five albums now, Echo and the Bunnymen have been reduced to a duo of Ian McCulloch and guitarist Will Sergeant. As distinctive as they both are, they miss the rhythmic push they used to get when they had a fully integrated rhythm section with as much creative agency in the band.\n", "Ed Sheeran": "The pop star’s compilation features Cardi B, Chance the Rapper, and Stormzy in a sometimes nice but hopelessly transparent attempt at a hip-hop crossover.\n", "Eddie Vedder": "Just like it says on the box: The Pearl Jam frontman strums and sings simple love songs. Chan Marshall of Cat Power guests.\n", "Editors": "Album number three from the popular UK post-punk acolytes finds them moving to a more synth-based sound to dreary effect.\n", "Eels": "On Eels’ 12th album, Mark Everett trots out his reflexive self-loathing and elementary rhyme schemes one more time, with no clear reason why.\n", "El Alfa": "The rising Dominican star carries dembow into the mainstream on this mammoth double album, sanding down some of the grimy genre’s rough edges in the process.\n", "El Guincho": "The Spanish producer who made his name with buzzing, colorful, maximalist free-for-alls returns with his most resolutely electronic work yet.\n", "El Michels Affair": "Wu-affiliated project offers an instant rap-geek curio for anyone who likes hearing bands cross the bounds of sample-based and live hip-hop instrumentation.\n", "El Tri": "Lee Ranaldo’s latest album is his finest post-Sonic Youth solo effort, featuring collaborations with Sharon Van Etten, Nels Cline, Kid Millions, and lyrics co-written with novelist Jonathan Lethem.\n", "Elbow": "Elbow’s latest deepens their formula—rich, sweeping rock songs about melancholy and love—with a dreamy sense of loss and time passing.\n", "Electric Guest": "The buzzed-about L.A. band's Danger Mouse-produced debut is a cautionary tale of what happens when a \"hit record\" forgets to actually include hits.\n", "Electric Light Orchestra": "Jeff Lynne's high-water mark-- a ridiculously heady orchestral pop record, with nods to disco and art-rock-- is given a deluxe reissue.\n", "Elf": "The Athens psych-pop mainstays 12th album buzzes and hums more like the Elf Power of old. The patina of fuzz that surrounds most of these tracks makes Sunlight on the Moon the scrappiest Elf Power collection in quite some time.\n", "Ella Mai": "The perfectly fine debut from the London R&B singer offers a grip of retro, snappy jams without sounding like a pastiche.\n", "Ellie Goulding": "With her fourth album, the pop songwriter reaches a welcome sense of self-assurance. But if this was supposed to be an introspective record, that’s not what’s happening musically.\n", "Elliott Smith": "Steeped in Acadian musical heritage, the Louisiana songwriter’s sketchy four-track recordings and odd, dreamy storytelling evoke the likes of Jessica Pratt or Elliott Smith.\n", "Elvis Costello": "Alternating between loud, sumptuously produced rock and softer, Tin Pan Alley-inspired songs, the British singer-songwriter delivers a brooding set of songs about time’s ceaseless march.\n", "Emeli Sandé": "The British pop star Emeli Sandé writes power ballads that start at “cinematic” and scale upward. Her second album places that massive voice atop tracks of stately but interchangeable gloom.\n", "Emily": "The Dutch songwriter follows behind-the-scenes work with Rex Orange County, The Free Nationals, and others with a breezy new solo record. Featuring collaborations with Mac Demarco and Emily King, the album does a good job distilling his charms into a single package. \n", "Eminem": "It is not, strictly speaking, a good record—Eminem hasn’t made one of those in a decade—but his latest boasts enough technical command and generates just enough arresting ideas to hold your attention.\n", "Emmanuel": "London resident who fled South Sudan releases his second album to coincide with screenings of a new documentary about his life; while some songs deal with the horrors he witnessed as a child solider, others concern culture shock and his struggles in the first world.\n", "Emmylou Harris": "New 20-track retrospective of ballads, hymns, and duets features appearances by Gram Parsons and Roy Orbison.\n", "Enigma": "The decade’s most tantalizing pop enigma officially releases a trove of unfinished material that was originally leaked online six years ago.\n", "Ennio Morricone": "Waxwork Records goes all out with its deluxe vinyl reissue of Ennio Morricone’s minimal score to John Carpenter’s The Thing—a 1982 box-office stiff that has only this century become a horror classic.\n", "Eno": "Pete Kember follows up his first album under the Sonic Boom moniker in 30 years with a remixed version that stands as its own discrete work, as impassioned and cohesive as the original. \n", "Enya": "Dark Sky Island is Enya's first album in five years, and it's her best since 1995's The Memory of Trees. Her songs feel sharper than they have in a long time: the textures are glassier, the ballads heartbreaking.\n", "Erasure": "The UK synth-pop duo’s 18th studio album attempts—but doesn’t quite attain—the electric thrill of the material that first made them pop sensations.\n", "Eric Church": "A year after headlining a night of the tragic Route 91 Harvest festival, the popular country renegade forgoes the obvious references on one of the most modest but poignant albums of his career.\n", "Eric Clapton": "Max Turnbull’s newest group takes its name from a song co-written by Eric Clapton and George Harrison—then stretches it from a three-minute pop song into a 14-minute improvisatory mission statement.\n", "Eric Prydz": "For many EDM acts, once they go pop, they stay pop, but Eric Prydz’s career has represented a kind of balancing act between overground notoriety and underground cred. Opus is a 19-song album collecting new material, fan favorites from Prydz’s own DJ sets, and even a few singles dating back as far as 2012.\n", "Erykah Badu": "Common’s 2002 album is a massive group effort: Prince, Erykah Badu, Pharrell, Jill Scott, and many more built a sound that helped change the limits of rap, soul, and R&B.\n", "Estelle": "Estelle's latest is a first in the R&B singer's catalog: a cohesive album experience, centered around themes of love and inspiration.\n", "Etta James": "More than a half-century after its release, At Last! remains one of the greatest records about loneliness ever made: a languid, jazz-inflected paean to (reluctantly) working it out on your own.\n", "Evanescence": "The Japanese-British pop singer’s debut is a Y2K flashback that’s as reverent of Evanescence and Korn as it is of Britney and Christina.\n", "Eve": "On her second album, recently reissued for its 20th anniversary, the lone woman of Ruff Ryders took the reins and made the loudest statement of her career.\n", "Everlast": "The Los Angeles singer-songwriter’s debut album is an ambitious, bilingual record that hops between influences, echoing the liminal state of a 26-year-old immigrant in America.\n", "Everything But The Girl": "Though their 1994 album became most famous for a surprise hit remix, Tracey Thorn and Ben Watt’s spare, pensive style never sounded more fully realized than here.\n", "Ex": "The DFA stalwart delivers a set of psychedelic, late-night club cuts that invoke the dancefloor at its most immersive.\n", "Example": "The Oakland R&B singer’s latest project is a shining example of both her emotional intelligence and her balmy, lucid songwriting.\n", "Extreme": "Descended from Yorkshire’s lineage of extreme computer music, the UK producer’s astonishing second album fuses jungle, singeli, acid, dancehall, and more into audacious yet danceable hybrids.\n", "FKA twigs": "The producer and visual artist builds an uncanny, disturbing world on his debut LP that recalls his collaborations with Björk, Arca, and FKA twigs.\n", "Fabolous": "Each Sunday, Pitchfork takes an in-depth look at a significant album from the past, and any record not in our archives is eligible. Today, we revisit the New York rapper’s unsuspecting 2001 debut, a breath of fresh air for a city who needed it. \n", "Faces": "The ninth album from the metalcore architects is sharp and urgent. The band's songwriting shines as they turn their back on interpersonal torment to face something bigger and more existential.\n", "Faith Evans": "Though the project oozes affection for Biggie, it’s yet another gangly, recycled posthumous album of verses we’ve all heard before—a painful tour through rap’s emptiest vault.\n", "Faith No More": "On their third full-length, More Faithful, Montreal shoegazers No Joy find subtle ways to deepen their sound. They recorded with Ariel Pink producer Jorge Elbrecht in Brooklyn and Costa Rica, and there's a little bit of the city and moments of the sea present on nearly every track.\n", "Faithless": "As a change of pace, our family unit went down to the dreary Jersey Shore for a rainy, cold January ...\n", "Falco": "Sierra Cassady (CocoRosie) and Matteah Baim create dark, spacious lullabies on their debut LP as Metallic Falcons.\n", "Fame on Fire": "While fame and fortune may’ve eluded them, the before-their-time New York City rockers’ influence is incalculable. Two decades on, their 1996 mini-LP sounds like a hiccup in the timeline.\n", "Fantasia": "Each Sunday, Pitchfork takes an in-depth look at a significant album from the past, and any record not in our archives is eligible. Today, we revisit a globetrotting fantasia on the Nintendo 64 that remains the high-water mark for video game music.\n", "Fatboy Slim": "The Talking Head and A-list dance producer gather 22 vocalists-- including Santigold, Tori Amos, and Florence Welch-- for a tribute to Imelda Marcos. Really.\n", "Fate": "The UK singer refines her sound into something moody and aquatic, trading a narrowly escaped adult-contemporary fate for narcotic electronic pop with ASMR undertones.\n", "Father John Misty": "Josh Tillman is still self-absorbed. But his fourth full-length as Father John Misty exhibits a new sense of empathy and vulnerability while losing none of his wit.\n", "Faye Webster": "The 21-year-old singer-songwriter’s third album is serene folk-pop with a mellow soul tinge and the melancholy clarity of someone twice her age.\n", "Feist": "After the grand farewell of 2016's You Want It Darker, Cohen's son gathers his father's scraps and unfinished ideas and lovingly fleshes them out with help from collaborators like Beck, The National's Bryce Dessner and Feist.\n", "Fetty Wap": "The 28-minute EP continues Fetty Wap’s steady decline from promising trap balladeer to one-dimensional chant rapper.\n", "Fey": "Under his oddball alter ego, Here We Go Magic’s Luke Temple presents himself as an Auto-Tune balladeer, Afrobeat enthusiast, and skilled craftsman of moody synth pop.\n", "Fifth Harmony": "Ricky Reed, the producer behind Lizzo’s “Truth Hurts” as well as hits by Jason Derulo and Fifth Harmony, offers a solo debut made via livestream and defined by a hazy, late-night melancholy. \n", "Finger Eleven": "For a few years now, this Finnish duo has been finding ways to merge its love of Joy Division and corpse paint into a dark and depressive sort of blackened post-punk, and this is arguably its strongest and most concise record.\n", "Finn": "With a collection of outtakes, demos, and acoustic reworkings from his three previous solo records, the Hold Steady frontman re-examines familiar characters from new angles.\n", "Fiona Apple": "Sharon Van Etten invites a handful of artists to cover songs from her 2010 album epic. These new versions—played by Fiona Apple, Lucinda Williams, and more—reveal the music’s healing power and complexity.\n", "First Aid Kit": "The Swedish folk duo’s fourth album is a showcase for their sweet harmonies, with some bold stylistic departures.\n", "Fisher": "Each Sunday, Pitchfork takes an in-depth look at a significant album from the past, and any record not in our archives is eligible. Today, we revisit Mac Miller and Vince Staples’ 2013 mixtape, an important document of two artists sparking fire in each other.\n", "Fivio Foreign": "Coasting on the success of last year’s “Big Drip”—which finds new relevance now that the phrase “demon time” is trending—the Brooklyn drill rapper shows personality but lacks focus.\n", "Flac": "Recorded over a period of just 10 hours, the future star’s breakthrough 1969 debut captured her idiosyncratic mix of soul, jazz, and folk and her singular vision as a bandleader.\n", "Flatbush Zombies": "The second studio album from the staunchly insular Brooklyn rap trio is streamlined and crisp, carried by a newfound momentum missing on their debut.\n", "Fleetwood Mac": "Each Sunday, Pitchfork takes an in-depth look at a significant album from the past, and any record not in our archives is eligible. Today, we revisit the calm before the storm, a long-out-of-print album from Lindsey Buckingham and Stevie Nicks before they joined Fleetwood Mac.\n", "Flex": "Drakeo’s second project of all-new material since being released from prison is more relaxed and less bitter than his first. There’s a subtext to every flex; he’s been through the wringer, and this is his time to celebrate.\n", "Flo Milli": "The brief, playful project from the Alabama rapper is one of the breeziest records of the year, a clinic on nimble shit-talking that’s as effortless as it is brash. \n", "Flume": "The Australian electronic-music producer and streaming behemoth signals a shift in his approach with a surprise mixtape featuring appearances from JPEGMAFIA and SOPHIE.\n", "Flying Lotus": "The instrumental edition of last year’s cosmic jazz-funk odyssey brings Flying Lotus’ detailed compositions and soundscaping to center stage.\n", "Foals": "The English band’s second album this year isn’t a complement to its predecessor so much as just another iteration on a now-standard formula.\n", "Focus": "The San Antonio-based musician brings newfound expression to her customary field recordings, folding richly harmonic elements into her typically cryptic palette of clatter and hum.\n", "Fonseca": "The Cuban pianist crafts a versatile album that seems to draw from Quincy Jones' late 1960s work, classic soul-jazz, and even vintage German television soundtracks, with a bit of Brazilian flavor thrown in.\n", "Foo Fighters": "Dave Grohl’s lawful-good lifestyle presents an eternal conflict between being unable to hate the guy and being unable to enjoy the music he continues to make.\n", "Foreigner": "The second album from Mary Timony’s band suggests that the hard rock of debut Rips was no dalliance: This time, they mine the denim-clad AOR of Billy Squier and Foreigner.\n", "Foster The People": "Mark Foster enlists more beat-filled haze for his third album, a tuneful but confounding modern pop event that lands somewhere between the Beach Boys and Just Blaze.\n", "Fountains Of Wayne": "Adam Schlesinger's group follows its surprise hit \"Stacy's Mom\" with a record of more of the same-- chugging verses, big choruses, and utter mediocrity.\n", "Foxes": "On his fourth album, singer-songwriter Robin Pecknold refines and hones Fleet Foxes’ crisp folk-rock sound, crafting another musically adventurous album that is warm and newly full of grace. \n", "Frank Reyes": "The Los Angeles producer's first Stones Throw release takes the bolero, the valse, and other traditional Latin forms and plays them on a solitary Oberheim synthesizer.\n", "Frank Sinatra": "Compiling six previously unreleased New York shows from 1955 through to 1990, this large box is a sequel to Sinatra's similarly themed Vegas set.\n", "Franz Ferdinand": "At its best, the fifth album from the UK indie-rock stalwarts is sleek, catchy, and enjoyably overwrought, the sound of a snappy hype band no longer burdened by relevance.\n", "Françoise Hardy": "Her first album since 2012 is a reflective, characteristically elegant session, surveying the singer’s advancing years in calm repose.\n", "Freddie Gibbs": "The gruff-voiced rapper and dusty-groove producer are a perfect match as they connect for a seamless ride to the heart of the gangster. \n", "Free Nationals": "The Dutch songwriter follows behind-the-scenes work with Rex Orange County, The Free Nationals, and others with a breezy new solo record. Featuring collaborations with Mac Demarco and Emily King, the album does a good job distilling his charms into a single package. \n", "Freeman": "The sequel to the canonical Atlanta mixtape is meant to be a legacy-defining stamp, but despite all its glossy guest stars (Morgan Freeman!), it never rises above “just fine.”\n", "Freestyle": "Each Sunday, Pitchfork takes an in-depth look at a significant album from the past, and any record not in our archives is eligible. Today, we revisit the 1993 album from the technically dazzling jazz-rap group that changed the national perception of West Coast hip-hop.\n", "French Montana": "Each Sunday, Pitchfork takes an in-depth look at a significant album from the past, and any record not in our archives is eligible. Today, we revisit the high-stakes saga of Max B and French Montana’s 2009 mixtape, a modern classic of New York rap.\n", "Friends": "The auspicious debut from the Chicago indie rock trio has the spontaneous feel of close friends bonding before the universe has a chance to pry them apart.\n", "Fruit Bats": "With Tripper, the group's fifth album, Fruit Bats dial their pulse back down, favoring spacious and spacey songwriting that sets the lyrics front and center. It's a record full of stories, simple narratives, and offbeat characters.\n", "Fuel": "The Aussie rockers’ unabashed fetishization of 1970s staples like punk, glam, and their country’s sharpie scene only helps fuel the invigorating rush of their music.\n", "Fugees": "Riding the wave of success from the Fugees’ The Score, Wyclef Jean’s 1997 solo debut is a 74-minute party, as advertised. It’s a proud transcultural product that broadcasted an eclectic future.\n", "Funkadelic": "Each Sunday, Pitchfork takes an in-depth look at a significant album from the past, and any record not in our archives is eligible. Today, we revisit a monument of psychedelic funk, a defining document of Black rock music in the early ’70s.\n", "Funky": "Inspired by a panoply of club-music styles like gqom, UK funky, and tribal, the Mexican producer’s music revels in eroding barriers between percussive techniques.\n", "Future": "After a debut album that reinterpreted Iberian folk for a contemporary audience, the Catalan duo turns toward the future, adding electronics and collaborating with Holly Herndon and Kronos Quartet.\n", "Future Islands": "The Baltimore band goes back to the well for another record of languorous, heart-on-the-sleeve synth-pop that hits all its marks but smacks of diminishing returns.\n", "Futuristic": "In songs as slick and futuristic as the screens that surround us, the Danish electro-pop musician uses technology as a frame for deeply human feelings.\n", "G-DRAGON": "The Korean pop star Kwon Ji-yong, best known as G-Dragon, is a massive commerical force in his home country. Coup d’Etat is a clear attempt at crossover, with guest spots from Missy Elliott, Baauer, Sky Ferreira, and Diplo.\n", "G-Eazy": "The Oakland rapper’s quarantine album is meant to portray a radically different artist. More often, he just finds new ways to telegraph the same stories he’s told all along.\n", "G-Unit": "Nearly a decade after helping revolutionize the sound of UK bass, the veteran Night Slugs producer struggles to maintain the radicalism of his early music on his debut album.\n", "Gal Costa": "With 1973’s Índia, the samba singer Gal Costa cemented her status as one of Brazil’s biggest and most defiant stars, collaborating with Caetano Veloso and Gilberto Gil in the process.\n", "Galantis": "Swedish pop duo Galantis are gleeful vocal manipulators who have written for the likes of Britney Spears and Icona Pop. On their new LP, their maximalism takes on the halting sounds of tropical house.\n", "Gambino": "Donald Glover’s got big hooks and big ideas, but his spiritual largesse is weighed down by impulses carried halfway to their endpoints and moments of frustrating pretense.\n", "Gang Starr": "It’s thrilling to hear them again, but once the glow wears off, there’s a hollowness to this posthumous project, cobbled together from unreleased Guru vocal takes.\n", "Garbage": "The Seattle scuzz-punk pioneers deliver a grave diagnosis of a festering societal condition.\n", "Gary Clark Jr.": "Leaning into both his songwriting and his studio experimentation, the Texas guitarist proves his eagerness to move beyond the confines of modern blues.\n", "Genesis": "Each Sunday, Pitchfork takes an in-depth look at a significant album from the past, and any record not in our archives is eligible. Today we revisit the 1980 album from the shapeshifting UK prog band, a pivotal moment in their journey to pop-rock stardom.\n", "George Harrison": "Each Sunday, Pitchfork takes an in-depth look at a significant album from the past, and any record not in our archives is eligible. Today, we revisit 1971’s Concert for Bangladesh, an era-defining event and live album that set the template for the large-scale benefit concert as we know it today.\n", "George Michael": "Each Sunday, Pitchfork takes an in-depth look at a significant album from the past, and any record not in our archives is eligible. Today we revisit the liminal sex-pop of George Michael’s 1987 debut album.\n", "Georgia": "Fronted by an Afghanistan war veteran turned firefighter and EMT, the Athens, Georgia, goths offer a take on the genre that’s both strikingly melodic and informed by the horrors of lived experience.\n", "Germ": "The latest signee to the $uicideboy$ label is an Atlanta skater-turned-rapper with a voice that’s as aggressive as it is gleeful. His new tape isn’t that serious, but his rapping is.\n", "Gesaffelstein": "The second album by the French producer Gesaffelstein brings in big pop collaborators like Haim and Pharrell.\n", "Get Scared": "The Reindeer Section has me anxious. Not scared, ya hear, but anxious. I am nervous about the dilapidated state of ...\n", "Ghostemane": "The nu-metal heir apparent's latest album is a tremendous step forward while still remaining an acquired, uncompromising taste.\n", "Ghostface Killah": "After a string of muted releases, Ghost strains to recapture some of the old Wu fire.\n", "Glass Animals": "The UK psych-pop band stretches out to embrace hip-hop production and personal biography. It comes across like a guy trying to tell you his life story in a packed Coachella tent.\n", "Glen Campbell": "The new record from 1960s hitmaker Glen Campbell is intended as his last. It’s a pleasant postscript, collecting covers of Bob Dylan and Willie Nelson, among others.\n", "Glenn Gould": "Two virtuosic performances of a Bach composition by the eccentric Canadian pianist brought Baroque music into the modern era. Together, they explore how art and taste evolve through time.\n", "Gnarls Barkley": "More focused than its well-liked predecessor, the second album from Cee-Lo and Danger Mouse is a less pop affair full of dark organic vibes.\n", "Gojira": "The acclaimed avant-metal outfit Gojira’s sixth full-length LP is their most accessible release yet, melodically immediate and charged with emotion.\n", "GoldLink": "GoldLink’s second album stretches far beyond his home in the DMV. It is a confluence of black music; hip-hop tracing its way back to the universal sounds of Africa.\n", "Gorillaz": "The allure of isolation defines Damon Albarn’s latest project. With only a few guests on the album, he writes simple, mostly upbeat songs with words of exhaustion.\n", "Gotye": "Here Australia singer-songwriter Walter De Backer finds room for psych-rock, soul, earnest balladeering, creepy retro-futurism, electronic and Tropicalia touches, and scads of serious-minded 1980s-inspired art pop.\n", "Granular": "On her newly reissued and expanded 2016 mixtape, Destiny Frasqueri—aka Princess Nokia—raps with granular detail about mysticism, childhood, and her native New York City.\n", "Grateful Dead": "Reissued for its 50th anniversary, American Beauty is undoubtedly the Dead’s most beloved studio album, a pure and potent representation of their style and philosophical outlook.\n", "Green Day": "The pop-punk stalwarts resist political commentary in lieu of making the most convincingly carefree Green Day record of the new millennium. \n", "Greta Van Fleet": "The debut from the young Michigan rock band is stiff, hackneyed, overly precious retro-fetishism.\n", "Grey": "Chromatics set their surprise “seventh” album at the witching hour, telling a sometimes-muddled tale of heartbroken lovers reaching out to the spirit realm.\n", "Grimes": "Citing Gwen Stefani and Grimes as influences, the L.A. duo’s heartfelt take on bubblegum is a sensitive sort of bombastic pop that wants you to be sensitive, too.\n", "Grimm": "Sorrowful lyrics against spirited playing create a magical crux on the experimental singer-songwriter’s latest, a powerfully maternal and spiritually yearning collection of dark folk music.\n", "Gringo": "Atlanta band-- working here with Animal Collective producer Ben Allen-- crafts its own version of British Invasion rock.\n", "Grizzly Bear": "The intricate compositions on the band’s fifth album are bound tighter than ever, evoking distant images and emotions that continually shift in and out of focus.\n", "Groove Armada": "Nineties big-tent dance music holdovers wisely enlist Lady Stush and ex-Sugababe Mutya Buena to help pepper their latest album with charm and sass.\n", "Grupo G": "First official release of new project from Mars Volta guitarist features two members of Hella and members of MV, including Cedric Bixler-Zavala.\n", "Guapdad 4000": "The Oakland rapper known for his standout scam records sinks into a more reflective mood on his latest LP. The cost of this pensive turn is a loss of personality.\n", "Gunna": "The latest compilation from Young Thug’s YSL label is packed with appearances from rap’s biggest stars, though its flamboyant host seems content to take a backseat.\n", "Guru": "On their full-length debut together, the UK techno producer and the Italian synth guru conjure a mood of pulsing electronic grandeur.\n", "Gus Dapperton": "The Brooklyn songwriter’s self-produced second LP is an introduction to the psyche beneath the quirky bowl cut. But its self-imposed pop formulas and strained symbolism reveal little.\n", "Guts": "Angel Guts: Red Classroom comes bearing the promise of being the most dark and bleak Xiu Xiu album to date. The source for the title of Jamie Stewart's L.A. album is a “Japanese erotic noir” that explores “racialized sex, double suicide, double penetration, criminality, fear of physical harm.”\n", "Gwen Stefani": "Citing Gwen Stefani and Grimes as influences, the L.A. duo’s heartfelt take on bubblegum is a sensitive sort of bombastic pop that wants you to be sensitive, too.\n", "H.E.R.": "After an auspicious debut in 2016, the young R&B enigma looks for ways outside of the sound that has become her trademark—and gets lost in the process.\n", "HAIM": "The third album from the trio is far and away their best. Intimate, multidimensional, and wide-ranging, the songwriting shines with personality and a great curiosity for melody and style.  \n", "HARDY": "On her second album as Wares, Cassia Hardy sings of rage, joy, and transformation on a dynamic and euphoric rock record. \n", "HI-LO": "Don’t be fooled by the of-the-moment pop sound: The 24-year-old singer’s debut album is the showcase for a refreshingly original perspective.\n", "Ha*Ash": "Fusing elements of free jazz, breakbeat, acid house, dub, ambient, and more, the Tokyo producer’s second full-length album is simultaneously comforting and destabilizing.\n", "Hailee Steinfeld": "After penning hits for Selena Gomez and Hailee Steinfeld, Julia Michaels brings her chart-topping songwriter chops to her solo career. The songs are refreshingly unique but their impact is varied.\n", "Hallé": "On the slinky follow-up to their carefree debut, the R&B sisters take greater risks with their production and their writing.\n", "Halsey": "Written from her own perspective, Halsey’s third album flips lonely self-awareness into a kind of strength. But some of its most compelling moments are overpowered by the tedium of modern pop.\n", "Hans Zimmer": "Former Ultravox/Buggles keyboardist and current Hollywood film bigshot Hans Zimmer gets the call to score the Simpsons Movie. Meanwhile, Alf Clausen-- longtime composer of all original music for \"The Simpsons\"-- has probably fired his agent.\n", "Hanson": "The Wand frontman’s second solo record blows open the chamber pop of his first for a lysergic and unsettling take on cosmic Americana.\n", "Harmless": "The latest EP from the versatile young singer is a harmless taste of pop-inflected R&B, a style in which Khalid sounds largely unremarkable.\n", "Harry Nilsson": "Rivers Cuomo pays tribute to his hermit orchestral-pop heroes, name-checking Harry Nilsson, Serge Gainsbourg, and Pet Sounds. But of course, it's all Weezer in the end. \n", "Hayley Kiyoko": "Hayley Kiyoko’s ambitious debut is at its best when it’s barbed and confrontational, but the former Disney star is still trying to hone her budding pop star identity.\n", "Healy": "Matty Healy, the enfant terrible of pop-rock, pushes his band all-in with a long, messy experiment that just so happens to peak with some of their sharpest songs ever. \n", "Herbie Hancock": "Each Sunday, Pitchfork takes an in-depth look at a significant album from the past, and any record not in our archives is eligible. Today, we revisit Herbie Hancock’s jazz-funk masterpiece, a celebration of all that is modern and ancient.\n", "Hinder": "Clunky lyrics and inept political analysis hinder Scott Kannberg’s most enjoyable solo album to date.\n", "Hit-Boy": "On his latest project, the Griselda Records rapper reflects on old battle scars and new riches over luxury beats helmed by Hit-Boy. Though he occasionally steps into cosplay, the result is ambitious.\n", "Hobo Johnson": "The second album from the viral star is crowded with histrionic vocals, tired emotions, and petty grievances, leaving little room to actually enjoy his music.\n", "Hole": "Rather than lean into the gimmick of a “bedroom” record, Cloud Nothings’ quarantine album disguises relatively amateur equipment behind clean melodies and power-pop nostalgia.\n", "Home": "The Detroit producer and vocalist leads a brief, unvarnished tour of his home city, allowing sounds and samples to function as landmarks in a woozy deep-house landscape.\n", "Hopsin": "On his corrosive fifth album, the rapper takes aim at several targets and whiffs spectacularly. His verbose, tryhard technique is a tired formula he employs without flow, direction, or meaning.\n", "Hot Chip": "The band’s seventh album is compulsively listenable, oddly moving, and stranger than it first appears.\n", "Hozier": "The man who took us to church tries to take us to the same church, again, 14 times, six years later.\n", "Huncho Jack": "The big personalities of both Quavo and Travis Scott are muted on their collaboration, one that feels lethargic even for a victory lap.\n", "Hurts": "Drakeo’s second project of all-new material since being released from prison is more relaxed and less bitter than his first. There’s a subtext to every flex; he’s been through the wringer, and this is his time to celebrate.\n", "IC3PEAK": "Couching politically brazen lyrics about police repression and state hypocrisy in a highly stylized goth maximalism, the high-concept Moscow duo is one of Russia’s most exciting bands right now.\n", "ILOVEMAKONNEN": "Now on his own label, the internet rap originator explores all his favorite styles—warbling rap, theatrical rock and pop—and the results are consistently joyous. \n", "INXS": "Each Sunday, Pitchfork takes an in-depth look at a significant album from the past, and any record not in our archives is eligible. Today, we revisit INXS’s fifth album, a pivotal and underrated moment for one of music’s most formidable, hit-making pop-rock bands.\n", "IP": "The Turkish sound artist balances technical precision, emotional potency, and trenchant cultural critique on an album whose individual sounds are as compelling as their widescreen narratives.\n", "IZ": "The southern rapper’s latest project captures him the same way he always is: perfectly likable, admirably sincere, predictably dependable and dependably predictable.\n", "Iamsu!": "DJ Mustard has the hits to rightfully claim ratchet music's crown, but Richmond rapper/producer Iamsu! has equally pushed the minimalist Cali sound to the masses. His debut LP, Sincerely Yours, is Su’s opportunity to move forward through the doors he's already opened.\n", "Ice Cube": "Death Certificate is Ice Cube’s most important (if not his best) album, and one of the most essential works in rap history.\n", "Icona Pop": "Swedish pop duo Galantis are gleeful vocal manipulators who have written for the likes of Britney Spears and Icona Pop. On their new LP, their maximalism takes on the halting sounds of tropical house.\n", "Idealism": "After a spate of singles, including early releases on Daft Punk-loving French imprint Kitsuné, this Hamburg house-rock duo pulls together work new and old for their first album.\n", "Iggy Azalea": "The Australian rapper returns with her first album in five years, sounding not just unrepentant but also tediously uninterested in any kind of growth whatsoever.\n", "Iggy Pop": "A new boxed set documents Iggy Pop’s formative years working alongside David Bowie in Berlin, the moment Pop left the sound of the Stooges behind and came into his own as a lone icon.\n", "Imagine Dragons": "Having shed the beardy affect and folksy shuffle, the band could now slip mostly unnoticed between Imagine Dragons and twenty one pilots, but their newly palatable sound could really use more quirks.\n", "Imogen Heap": "Go-for-broke record filts between Curve-like sulking and Lilith Fair-like emoting.\n", "In Flames": "After 2018’s prickly IRISIRI, the Queens experimental musician narrates a personal and artistic rebirth in spare songwriting fleshed out with acoustic guitar, strings, and turbulent sound collages.\n", "In This Moment": "Drawing on funk, Afrobeat, and spiritual tradition, two beautifully crafted albums from the elusive UK group passionately consider the entirety of the Black experience in this moment.\n", "Interpol": "Bringing together members of Interpol, the Walkmen, and Bonny Light Horseman, the indie supergroup’s debut album is a carefully crafted pastoral travelogue.\n", "Iron & Wine": "Featuring artists like Superchunk, the Mountain Goats, and Iron & Wine, this 25-song benefit compilation for the beloved North Carolina venue Cat’s Cradle boasts far more riches than a charity project requires.\n", "Isaiah Rashad": "The Tennessee rapper and TDE associate really finds his voice on his second album, one filled with the tensions caused by a cycle of self-loathing and self-discovery.\n", "Ital": "The Melbourne quintet’s second album strolls through familiar territory with good guitar work and good songwriting that never quite peaks where it used to. \n", "Ivy Queen": "Each Sunday, Pitchfork takes an in-depth look at a significant album from the past, and any record not in our archives is eligible. Today, we revisit Diva, an album that captures Ivy Queen’s legacy as an ardent lyricist and vocalist, a forceful defender of women, and a torchbearer for reggaetón’s subversive—and commercial—promise.\n", "J Balvin": "Already a global star, reggaetón’s reigning hitmaker tries his hand at becoming an auteur with an audiovisual album. \n", "J Dilla": "The two students of J Dilla consolidate their skills to create a free-spirited project around joy and fellowship, with a few meandering moments.\n", "J Stone": "The film actor’s musical debut is full of shadowy theatrics and cryptic gibberish. Rarely do you encounter music this bombastic and unreasonable.\n", "J. Cole": "The Pro Era rapper channels the adolescent moodiness of Machine Gun Kelly and the aspirational navel-gazing of J. Cole.\n", "JAY-Z": "The soundtrack to the Shaka King-directed film, featuring heavyweights like JAY-Z and Nas alongside newer stars like Polo G and Pooh Shiesty, exploits Hampton’s image to peddle liberation-lite Billboard hits. \n", "JID": "As pleasant and groovy as it is, the collaborative album never feels like a true Roy Ayers work. \n", "JIN": "On her second EP, the South Korean producer branches out from the house music of her debut, touching upon juke, trap, and techno while sing-rapping in a mixture of English and Korean.\n", "JPEGMAFIA": "The experimental rapper remains an impish writer and an athletic vocalist on his latest album, one that lays bare the sprawling collage in his fiery, fascinating brain.\n", "JR Williams": "Billed as a country album, the latest LP from the idiosyncratic soul artist born Jerry Williams Jr. examines grief from a distance, taking time to savor life’s little sweetnesses.\n", "JUVENILE": "A decade-plus after splitting from Cash Money, the New Orleans legend reunites with Birdman for a shockingly strong late-career-reunion record.\n", "Jack Harlow": "The genial Louisville rapper doesn’t have much of an identity, but he has a natural, low-stakes charm.\n", "Jack White": "Released through Third Man’s record club, Jack White’s 3xLP live set takes some of his knotty, obtuse songs from this year’s Boarding House Reach and lets them breathe on stage.\n", "Jackson Browne": "On her 1967 debut album, Nico’s unmistakable voice sings the songs of Bob Dylan, Lou Reed, and Jackson Browne. Chelsea Girl helps define her as a mercurial aura and a manifold, complicated artist.\n", "Jaco": "In a collaboration with the stunning singers Theo Bleckmann and Jodie Landau, the sharp young composer processes poems and strings into surprisingly magnetic meditations on time.\n", "Jacquees": "The self-appointed (and much-derided) new King of R&B attempts to live up to his own hype with a slick and ambitious new LP.\n", "Jadakiss": "On the New York rappers’ collaboration, just about every bar is sharply written, rapped, and also could’ve been plucked from any project these two have done in the 21st century.\n", "Jaden": "The young polymath’s latest album is mostly a slog, the sound of an artist with a blurry vision and too many resources at his disposal.\n", "James Blake": "There’s a suffocating seriousness that runs through the singer and producer’s fourth album, one that bogs down genuine moments of levity and love.\n", "James Brown": "James Brown: The Disco Years. You also get two versions of a University of Georgia football theme-- the perils of being comprehensive.\n", "James TW": "The renaissance of Richard D. James continues with his latest EP, a knotty, meticulous, and joyous collection that ranks among his best late-career albums.\n", "Jamie xx": "Featuring collaborations with Skrillex and Jamie xx, the West Coast transplant’s debut album flips the chamber-folk cello of her debut EP into a contemporary, decidedly Los Angeles hybrid sound.\n", "Jamiroquai": "The British dance-funk group return with their first album in seven years, not so much cashing in on retro styles but leaning into it like they always did.\n", "Jane's Addiction": "On the 20th anniversary of their initial dissolution, the alt-rock OGs release an album produced by Muse-man Rich Costey and featuring TV on the Radio's Dave Sitek and Guns N' Roses' Duff McKagan, among others.\n", "Janelle Monáe": "Ever the innovator, Janelle Monáe has crafted a singular, youthful pop record that is the culmination of years of silence and deflection in order to one day be free.\n", "Janet Jackson": "A collection of the late soul singer’s covers of songs by Janet Jackson, Prince, and others reveals her remarkable ability to reinterpret classic sounds while refusing to be relegated to the past.\n", "Jasiah": "The Ohio rapper’s new EP devours a half-decade of online scenes and styles and spits them out into a psychedelic combination that often feels overly referential.\n", "Jason Derulo": "Ricky Reed, the producer behind Lizzo’s “Truth Hurts” as well as hits by Jason Derulo and Fifth Harmony, offers a solo debut made via livestream and defined by a hazy, late-night melancholy. \n", "Jason Isbell and the 400 Unit": "The alt-country singer-songwriter’s new album moves steadily and carefully, lingering on the conflicted emotions of his finely-etched tales and the band’s textured, elegant understatement.\n", "Jay-Roc": "After a life-threatening motorcycle accident, Jay Rock returns with his strongest album yet, a collection of rap songs that highlight his struggle and journey.\n", "Jazmine Sullivan": "On her fourth album, Jazmine Sullivan contends with all that can be lost and gained through sex and love. She is in full command of her spectacular voice and totally delivers on an ambitious concept.\n", "Jean-Michel Jarre": "Electronic music pioneer Jean-Michel Jarre's latest album features guest spots from The Pet Shop Boys, Primal Scream, Cyndi Lauper, and...Edward Snowden.\n", "Jeezy": "Jeezy is less effective these days, as his new album attests. But he covers gaps in his writing with a few tricks and guest appearances from Kendrick, Rick Ross, YG, 2 Chainz, and others.\n", "Jeff Buckley": "Jeff Buckley died before completing his second album. Sketches for My Sweetheart the Drunk, compiling those sessions, gives a glimpse into an erratic mind that could be too mercurial for its own good.\n", "Jeremih": "On their debut collaborative album, R&B’s most self-aware lotharios synthesize their respective approaches in quixotic pursuit of sexual healing.\n", "Jessie Reyez": "The powerhouse singer’s voice is chameleonic and present in every guise. Her debut is most satisfying not because she whizzes across multiple genres, but because of the skill she displays at each.\n"}