{"Jetlag": "Michael Milosh, the Toronto-based singer/producer who fronts Rhye, has been releasing his own music for nearly a decade. If you discovered Milosh via Rhye, don’t expect to hear his unmistakeable voice surrounded by the same kind of silky soul on this chilly solo offering.\n", "Jhené Aiko": "Where her last album explored grief, the R&B singer’s latest is more grounded, exploring the ups and downs of a failed relationship.\n", "Jill Scott": "Each Sunday, Pitchfork takes an in-depth look at a significant album from the past, and any record not in our archives is eligible. Today, we revisit the 2000 debut of Jill Scott, a neo-soul chronicle that brought love and sex to the everywoman.\n", "Jim Jones": "Dipset were always a theater of the absurd. On their first album in more than a decade, Cam’ron, Juelz Santana, and Jim Jones become a trio of almost no effort.\n", "Jimi Hendrix": "Near the end of his life, Jimi Hendrix recorded two concerts in Hawaii for an ill-fated film. A new reissue reveals him elevating above an earthly debacle to offer a glimpse of transcendence.\n", "Jimmy Cliff": "Rebirth is a perfect companion to Jamaica's independence. It reaches back to the era of ska, travels through the era of rockers and roots reggae, and demonstrates the power of the music today.\n", "Jimmy Eat World": "The beloved Arizona emo band’s latest is a solid, self-aware effort, missing only a few risks.\n", "Jodeci": "Twenty years on from their third album The Show, the After Party, the Hotel, Jodeci’s returned to a hip-hop and R&B landscape that’s more sexually liberated than ever before. They remain a group of soul classicists, thematically inspired by the intimacy and lewdness of sex and buttressed by the aesthetic and energy of hip-hop.\n", "Joe": "This new compilation adroitly selects high-water marks from Strummer’s solo career while never quite ameliorating the “what if” questions that haunt the Clash’s legacy.\n", "Joey Bada$$": "Statik Selektah, a hip-hop mainstay, brings Action Bronson, Joey Bada$$, Raekwon, Prodigy and more for a boppy, East Coast delight that doesn't make the best use of the producer’s intuition.\n", "John Coltrane": "Holed up in their East Harlem apartment, the bassist and harpist express the early days of lockdown intimately and beautifully with one mic and a set of mostly covers from John Coltrane to Kate Bush.\n", "John Lee Hooker": "Each Sunday, Pitchfork takes an in-depth look at a significant album from the past, and any record not in our archives is eligible. Today, we revisit the singular sound and the one-chord wonder of the iconic bluesman’s 1966 album. \n", "John Legend": "The R&B star’s latest ode to the power of love bursts with positive energy, but there’s an emptiness beneath. \n", "John Lennon": "Each Sunday, Pitchfork takes an in-depth look at a significant album from the past, and any record not in our archives is eligible. Today, we revisit the infamous 1974 album Pussy Cats, produced by John Lennon, the moment a would-be titan consigned himself to a tragic cult figure.\n", "John Mayer": "Each Sunday, Pitchfork takes an in-depth look at a significant album from the past, and any record not in our archives is eligible. Today, we revisit the auspicious debut that sent a 23-year-old guitarist into the stratosphere.\n", "John Prine": "Recorded at Nashville’s famed Butcher Shoppe, Vile’s lovely and bittersweet new EP mixes covers and originals, including a duet with the late John Prine.\n", "Johnny Cash": "Dylan's latest installment in his long-running Bootleg series is one of the shortest, the highlight of which is his collaboration with Johnny Cash. \n", "Johnny O.": "In his latest reinvention, the Smashing Pumpkins frontman hires Rick Rubin to deliver a prestige comeback album in the producer’s usual stripped-down and soul-baring mode—but Corgan is no Johnny Cash.\n", "Johnson": "The California pedal steel guitarist makes inventive use of space and place on a quietly mournful album where lost forests and shuttered venues endure in intangible anonymity.\n", "Joji": "Joji’s first full-length project features a host of guests in a quality effort to help push past the confines of his bedroom walls and tedious heartache.\n", "Jojo": "After a decade of record label turmoil, the pop singer JoJo—of “Leave (Get Out)” fame—returns with a sincere third album, featuring guest spots from Alessia Cara, Wiz Khalifa, and Remy Ma.\n", "Jon Hopkins": "Pitched between heat-seeking acid house and ambient bliss, the techno auteur’s first album since 2013 is a beat-music odyssey that thrums with spiritual resonance.\n", "Jon Z": "Channeling an eerily affecting cyborg tenderness, the Austrian producer and digital nomad writes post-club anthems that sound like pop hits from a parallel universe.\n", "Jonas Brothers": "The former teen heartthrobs’ first album in almost 10 years is by no means extraordinary, but it’s a respectable showing from a group that has long deserved more respect than they got.\n", "Joni Mitchell": "In its day, this 2007 album felt like a response to turbulent times. Revisiting the newly reissued LP, its songs feel untethered to any political moment: protest songs delivered as solemn premonitions.\n", "Jorja Smith": "The precocious 20-year-old singer fuses R&B, soul, and trip-hop on a debut album that documents her ongoing quest to discover who she is and how she fits into a troubled world.\n", "Josh A": "The Chicago bassist and guimbri player turns in a minimalist mountain of an album, one whose slow pace and gradual changes prove unusually mesmerizing, even sublime.\n", "José González": "By 2007's In Our Nature, José González was mentioned alongside whispery and haunted projects like Bon Iver, Iron & Wine, and Sun Kil Moon. The Swedish singer-songwriter's first solo album since finds him picking up where he left off.\n", "Journey": "The Pakistan-born, Brooklyn-based composer draws from jazz, Hindustani classical, and folk to create a heartbreaking, exquisite document of the journey from grief to acceptance.\n", "Joy Again": "Ty Segall and Tim Presley lock into a psychedelic hive mind again for an exciting, wildly varied album made to be combed through and prodded.\n", "Joywave": "The second album from the synth-pop group finds them getting anxious about their own ambition, a feeling that doesn't always gracefully adapt to the dance floor.\n", "Juelz Santana": "Dipset were always a theater of the absurd. On their first album in more than a decade, Cam’ron, Juelz Santana, and Jim Jones become a trio of almost no effort.\n", "Juice WRLD": "The Chicago artist’s first posthumous release doesn’t feel like a final goodbye, but instead a continued look inside his world. It’s bleak and beautiful.\n", "Juicy J": "On his fifth solo album, the Memphis legend invites guests like Jay Rock and Megan Thee Stallion, splitting the difference between coasting and staying fly.\n", "Julia Michaels": "After penning hits for Selena Gomez and Hailee Steinfeld, Julia Michaels brings her chart-topping songwriter chops to her solo career. The songs are refreshingly unique but their impact is varied.\n", "Julian Casablancas": "The second album from Julian Casablancas and his motley New York band is sludgy, psychedelic sesh that occasionally coheres into surprising moments of clarity and radiance.\n", "Julie London": "The London producer pays tribute to his musical and familial heritage on a sophomore album that makes vintage Roland gear sound new again.\n", "Julien": "On her third album, Julien Baker’s self-lacerating storytelling gets a more expansive canvas to work with. The big, full-band sound makes all the small moments of pain surreptitiously devastating.  \n", "Jungle": "The longtime Red Hot Chili Peppers guitarist swaps the acid-house influences of his Trickfinger project for a loving tribute to ’90s jungle and drill’n’bass.\n", "Junior H": "The remix EP to last year's striking album So This Is Goodbye lends further weight to the notion that Junior Boys are one of those rare bands that are in continuous conversation with the musical world around them.\n", "Justin Bieber": "Underneath the ill-advised MLK quotes, you’ll find an earnest pop album that unearths the charisma and agility that helped make Bieber a star.\n", "Justin Timberlake": "Justin Timberlake’s fifth album is a huge misstep for the pop star. It is warm, indulgent, inert, and vacuous.\n", "Jyoti": "The third installment of Georgia Anne Muldrow’s solo jazz project is a powerfully resonant and spiritual record, a call-and-response between herself and a history of Black music. \n", "K CAMP": "The Greek dream-pop duo opens its first Planet Mu EP with an excellent Solar Bears remix that sets up high expectations for the band's original material.\n", "K-Jo": "A collection of the late soul singer’s covers of songs by Janet Jackson, Prince, and others reveals her remarkable ability to reinterpret classic sounds while refusing to be relegated to the past.\n", "KISS": "On his solo instrumental debut, the New York acoustic guitarist balances the romantic dynamics of flamenco and the meticulousness of Windham Hill with the unguarded qualities of improvised music.\n", "KK": "There's something admirable about surviving. When you look at the kind of people who have made it through the ...\n", "Kacy Hill": "The singer and former G.O.O.D. Music signee returns with a palette of adult contemporary synth-pop and early-’10s R&B. It’s bright and open, built with sounds that move and breathe with the artist.\n", "Kaiser Chiefs": "The Leeds quintet's third LP recaptures some of the ebullience (and charm) of their 2005 debut, Employment, after the darker cynicism of the follow-up, Yours Truly, Angry Mob. Lily Allen guests on two songs.\n", "Kali Uchis": "On her first Spanish-language LP, the Colombian American singer eclipses crossover appeal with a moody, hopscotch pop take on the boleros, reggaetón, and Latin soul of her youth.\n", "Kansas": "An indie folk record with tinges of country rock, the songwriter’s latest album pays tribute to his Kansas City home with a vision of the Midwest that feels mythical and enormous.\n", "Kanye West": "Kanye West’s executive-produced gospel album is the most realized music to come from this era of his career. The production and the choir’s dynamic power creates an almost hallucinatory effect.\n", "Kasabian": "The Irish modern-rock producer, best known for his work on records by U2, Snow Patrol, and Kasabian, opts for an idiosyncratic electronic melange featuring a surprising roster of guests.\n", "Kash Doll": "Kash Doll’s short, 22-minute album contains a lot of flex, some humility, but feels like a victory lap run before the official race has even started.\n", "Kate Bush": "Holed up in their East Harlem apartment, the bassist and harpist express the early days of lockdown intimately and beautifully with one mic and a set of mostly covers from John Coltrane to Kate Bush.\n", "Katy Perry": "Each Sunday, Pitchfork takes an in-depth look at a significant album from the past, and any record not in our archives is eligible. Today we revisit Katy Perry’s second album, a sugary pop juggernaut with big misses and even bigger hits.\n", "Kavinsky": "Kavinsky's \"Nightcall\" is almost as synonymous with Drive as Ryan Gosling. The French musician's new album isn't linked to a film, but centers around an automotive story of Kavinsky's creation, and replicates the soundtracks to 1980s driving video games with eerie accuracy.\n", "Kay-K": "The second album from the mercurial singer lets listeners in on another intimate journey of self-reflection, this time drawing on laconic folk, downtempo rock, and upbeat disco. \n", "Keane": "Corny Coldplay copycats try to loosen up and project fun on their new EP. Feel-good MC K'naan guests, which actually makes sense.\n", "Kehlani": "The cloudy grooves of the Oakland singer’s second full-length album showcase her voice and her clear-eyed approach. These are love songs about all the forces that make and break romance.\n", "Keith Jarrett": "A newly released date from the pianist’s 2016 European tour toggles between dizzyingly athletic avant-garde jazz, foot-stomping ragtime, and a few tender standards.\n", "Kelis": "Kelis' new Food—produced by TV on the Radio's Dave Sitek and released on indie Ninja Tune—shows the singer in unusual form: ragged, raspy, somewhere between exhausted from effort and deep in reflection.\n", "Kendrick Lamar": "Following his high-profile features on records by Kanye and Kendrick Lamar, the veteran dancehall deejay returns with an idiosyncratic album that subtly challenges the conventions of dancehall itself.\n", "Kenny Beats": "The duo’s refurbished EP gets the typical sequel treatment, with new characters and a glossy finish that makes you miss the gritty original.\n", "Kenny G": "The incarcerated Watts rapper’s latest is a loosely movie-themed collaboration with producer-of-the-moment Kenny Beats.\n", "Kero Kero Bonito": "The news is hardly any less grim since 2019’s Civilisation I, but the UK pop trio’s second entry considers the emotional toll of disaster with ingenuity, wit, and a warm, bright sound.\n", "Kesha": "The celebrated pop star’s fourth album attempts a return to the carefree party pop that defined her early career.\n", "Kevin Abstract": "The BROCKHAMPTON star’s latest solo album is an often powerful document by a queer artist who has weathered life’s bruises.\n", "Kevin Gates": "The Floridian singer-rapper delivers tender anthems about his pain and inner demons on his debut LP, executive produced by Kevin Gates. \n", "Key Glock": "The Memphis rap duo reunites for an impressive sequel that’s as natural and effortless as an old friendship.\n", "Khaled": "DJ Khaled has ranged from summertime hitmaker to self-help guru, but neither are all that interesting on his latest guest-filled album. There are plenty of voices but no clear message or intention.\n", "Khalid": "The second album from the historically inoffensive singer is another genreless collection of safe choices for a pop star in the making.\n", "Khan": "Co-produced by UK dance mainstay Switch, this comeback album largely ignores all the qualities that made the Queen of Funk a legend in the first place.\n", "Khruangbin": "A mixtape from Houston’s worldly psych trio digs deep into funk classics, spiritual jazz, and unusual finds from South Korea, Belarus, and Nigeria.\n", "Kid Cudi": "The latest, underwhelming installment of the rapper’s cosmic album series arrives 11 years after the original and coasts on a legacy built a lifetime ago.\n", "Kid Rock": "A little Gary Glitter, a little Kid Rock, even a little Smash Mouth—the third album from these former California party kids holds nothing back.\n", "Kiesza": "After a car accident derailed her life, the pop singer returns with her second album, compacting emotional and romantic upheaval into tactile electro-pop packed with splashy synths and soaring melodies.\n", "Kiiara": "The pop singer’s debut is a promising reintroduction that shows her emotional and melodic strengths if she can avoid the clichés of influencer culture and the digital age.\n", "Kimbra": "The New Zealand musician’s third album is a collision of hard electronics with a touch of R&B. Though it contains moments of great power, it sounds like a work that’s stuck between two places.\n", "King Gizzard & The Lizard Wizard": "On this double album, the madly prolific psych-rock band synthesizes everything they do into compact songs that still allow their weirder impulses to flourish. \n", "King Krule": "This south London rapper and King Krule associate evokes the carefree heyday of ’90s UK garage.\n", "King Princess": "The viral phenom’s full-length debut cuts her modern pop sensibility with doses of historicism, embracing opposing energies with effortless swagger.\n", "Kings of Convenience": "Ignoring calls to fold Erlend Øye's hushed beats into their hushed folk, the Kings of quiet return with their most whisper-soft-- and graceful-- record yet.\n", "Kings of Leon": "On their eighth album, the Followill brothers desperately cling to a sound that has stopped working, trying to write songs that soar but capable only of ones that wallow.\n", "Knife Party": "The Washington, D.C. trio make visceral, minimal punk that’s as stripped down as a roadkill carcass, and almost as gross.\n", "Knxwledge": "The L.A. producer’s music is a fog of samples and clips warped into peculiar shapes that defy recognition but prickle with familiarity, like memories from a past life.\n", "Kodak Black": "On his so-called R&B album, it’s exceedingly difficult to square the real-life allegations of the Florida rapper with the toxic content of his songs.\n", "Korn": "The Japanese-British pop singer’s debut is a Y2K flashback that’s as reverent of Evanescence and Korn as it is of Britney and Christina.\n", "Krono": "Utilizing space recordings and scraps of poetry, the minimalist titan and his long-time collaborators grapple with humanity’s place in the universe.\n", "Kurt Vile": "Featuring co-production from Kurt Vile, the classic trio’s latest reunion album is their breeziest and most melodically generous yet.\n", "Kurupt": "After last year's lauded DJ Quik collab BlaQKout, the former Death Row mainstay finds a less fruitful partnership in Snoop producer Terrace Martin.\n", "Kyle": "The Montreal ambient musician’s albums all resemble each other in their broad strokes and abiding stillness. They are beautiful, terrifying, and bittersweet all at once.\n", "LA INDIA": "From Indian Lakes’ fourth LP is mood music for the hopeless romantic, overwhelmed by the desire to connect but pining for the confidence to make the first move.\n", "LANY": "The synth-pop group aches with boy-band sincerity over sugary arrangements and even a little pedal steel on their anodyne new album.\n", "LCD Soundsystem": "The version of the band that toured behind 2017’s American Dream gathers in the legendary New York studio, giving old songs new life and additional oomph.\n", "LP": "The Floridian emo band channels a sense of boundless possibility on their new LP, which has the heft of a manifesto despite its compact length. \n", "La Bouche": "The fourth release in Superchunk's live, limited-edition Clambake series, Sur La Bouche: Live in Montreal 1993 finds the band endearingly devoid of bullshit and devoted to writing songs powered by things often, oddly missing from today's indie rock: energy and volume.\n", "La Mafia": "After a shock Oscar win and a deeply embarrassing MTV reality show, it still took Last 2 Walk more than a year of delays to appear, even though most of it is essentially the same sort of music these guys have been churning out for nearly 20 years.\n", "La Roux": "Following bandmate/producer Ben Langmaid's departure, La Roux's second album still sounds like La Roux: slick, bright, and instantly familiar. This record breathes more than their debut, with slower tempos and less of an emphasis on vacuum-sealed electronics.\n", "La Unión": "The Georgia post-punk band Arbor Labor Union are veterans of various punk and hardcore bands, and on their new album they expand on the rootsy drone of their first.\n", "Labrinth": "Diplo, Sia, and Labrinth combine forces for an album of truly forgettable pop music that is too tired to be wired.\n", "Ladi": "Austria-born, Barcelona-based producer Zora Jones makes tracks indebted to Chicago footwork, but with a unique vision. Her work suggests club music injected with helium and sent bobbing high overhead, and for all the flyaway nature of her sounds, her compositions carry real emotional weight.\n", "Lady A": "The singer-songwriter’s latest—a loose reworking of Billie Holiday’s 1958 album Lady in Satin—is made with affection, curiosity, and care. \n", "Lady Gaga": "With incomparable flair, the pop diva returns to her dance-pop days with a fabulously fun and deeply personal album that is at turns bizarre, theatrical, and ambitious.\n", "Lamb of God": "Despite the Roman numerals and German words in its title, Lamb of God’s seventh album is a satisfactorily settled, gimmick-free record. VII: Sturm und Drang, featuring a guest spot from the Deftones' Chino Moreno, is also the metal stalwarts' most alluring album in years.\n", "Lana Del Rey": "Lana Del Rey’s sixth album dials back the grandiosity in favor of smaller, more intimate moments. It carries a roaming spirit of folk and Americana without losing the romantic melodrama of her best work.\n", "Lane 8": "After some nebulous false starts, the former hardcore band has finally found space to carve their own lane in the crowded field of ’80s-indebted groups.\n", "Lang Lang": "The latest compilation from Young Thug’s YSL label is packed with appearances from rap’s biggest stars, though its flamboyant host seems content to take a backseat.\n", "Larry": "Each Sunday, Pitchfork takes an in-depth look at a significant album from the past, and any record not in our archives is eligible. Today, we revisit Mac Miller and Vince Staples’ 2013 mixtape, an important document of two artists sparking fire in each other.\n", "Laura Marling": "The starkly beautiful seventh album from the venerable singer-songwriter reveals more of her aged wisdom through winding narratives rich with humor and despair.\n", "Lauv": "Pop singer Ari Leff advocates powerfully for being forthright about your feelings, but his album’s whopping 21-song tracklist is underwhelming and repetitive.\n", "Le Tigre": "After two albums and a handful of singles' worth of hook-filled electro-punk and progressive politics, Kathleen Hanna's propulsive trio are rewarded with a major-label deal and a chance to take their message to the mainstream.\n", "League of Legends": "John Darnielle explores the humanity of wizards, sports legends, Ozzy Osbourne, and other folk heroes and beacons of hope.\n", "Led Zeppelin": "A deluxe reissue of the band’s 1976 live fantasia highlights its charms and absurdities. It remains a messy, psychedelic document of Zeppelin in their imperial era.\n", "Lennox": "The debut album from the neo-soul singer-songwriter is driven by warm funk and soul and has the healing familiarity of hanging out on the couch commiserating with a best friend.\n", "Leo Dan": "After the grand farewell of 2016's You Want It Darker, Cohen's son gathers his father's scraps and unfinished ideas and lovingly fleshes them out with help from collaborators like Beck, The National's Bryce Dessner and Feist.\n", "Leonard Cohen": "After the grand farewell of 2016's You Want It Darker, Cohen's son gathers his father's scraps and unfinished ideas and lovingly fleshes them out with help from collaborators like Beck, The National's Bryce Dessner and Feist.\n", "LiSA": "Like Octavia Butler’s Afro-futurist science fiction, which inspired the piece, this experimental septet performance can seduce, challenge, and unnerve in the span of a few measures.\n", "Liam Payne": "The former One Direction member’s solo debut is just another pop star flailing to find his identity amid trend-hopping production and half-baked lyrics.\n", "Liberación": "After a downer of a sophomore album, the Brazilian group's third record finds the band torn between pandering to the hopped-up hedonists who want to rip off Lovefoxxx’s clothes when she does a stage dive and a desire to dial down the crassness and redefine their character.\n", "Lights": "The German producer’s smooth dance-pop is meant to be played under bright festival lights—and it’s never sounded less convincing.\n", "Lil Baby": "Lil Yachty consummates his unlikely relationship with Michigan rap on a mixtape pairing him with mainstays like Sada Baby and Rio da Yung OG.\n", "Lil Durk": "Chicago drill star Lil Durk cedes the floor to his capable crew on a 23-song victory lap that memorializes his own hard-earned fame alongside the memory of his late protégé, King Von.\n", "Lil Keed": "The Atlanta rapper finally steps out of Young Thug’s shadow and showcases his own style and versatility.\n", "Lil Peep": "Working with Lil Peep collaborator Nedarb, the Riverside rapper makes 10 songs feel like a great house party right before someone calls the cops. \n", "Lil Pump": "Having abandoned his lo-fi roots in the South Florida rap scene, Lil Pump has become a caricature of himself. His second album is sometimes fun but mostly unnecessary.\n", "Lil Skies": "The buzzing rapper’s debut mixtape is an easygoing 40 minutes of sugary trap and mellow, blissfully hazy vibe-music that runs with the sounds of the moment without advancing them much.\n", "Lil Tecca": "On the 18-year-old New York rapper’s debut album, a pocketful of catchy melodies and bubbly rhythms don’t make up for a lack of anything interesting to say.\n", "Lil Tjay": "The Brooklyn rapper follows in the footsteps of A Boogie Wit Da Hoodie and Lil Tjay, crafting sweetly melodic songs about pain and young love.\n", "Lil Tracy": "Ishmael Butler, the MC of the futurist hip-hop duo, looks in a new direction for inspiration on his latest project: his own son, emo rapper Lil Tracy. \n", "Lil Uzi Vert": "After an illegal remix made him a TikTok hit, the Brooklyn rapper-singer struggles to create an identity on his new album,  enlisting high-profile guests like Kanye, Lil Uzi Vert, and Future in the effort. \n", "Lil Wayne": "With his big legacy album Tha Carter V out of the way, Weezy is back in the booth and cruising, experimenting with an array of styles and a dizzying maze of wordplay.\n", "Lil' Kim": "Kimberly Jones, who has spent most of her professional career simultaneously infuriating/heartening feminists, releases her confessional album.\n", "Lil' Mo": "SeeFu Lilac consists of outtakes and fragments from a never-finished Black Moth Super Rainbow album. It's musical ephemera at best, perfectly suited for the rabid BMSR fanbase, but not much else.\n", "Lily Allen": "Pilloried in the press for her every misfortune, Lily Allen scrutinizes her public persona on an album that dilutes staggering sincerity with uninspired beats.\n", "Linda Ronstadt": "Each Sunday, Pitchfork takes an in-depth look at a significant album from the past, and any record not in our archives is eligible. Today, we revisit a landmark of mainstream ’70s soft-rock, the peak of Linda Ronstadt’s power as a singer nonpareil.\n", "Linkin Park": "The California band’s blend of rapping, screaming, and circuit-bending defied easy categorization. Their sharpest tendencies meshed on Hybrid Theory, the most popular rock music of the 21st century.\n", "Lisa Gerrard": "Former Dead Can Dance singer boasts an expansive, enigmatic voice. So why boil it down to a banal best-of?\n", "Little Dragon": "The Swedish electro-pop group’s first album for Ninja Tune is a welcome departure, finally infusing their own studio work with the creative energy of their collaborative sessions.\n", "Little Mix": "The debut tape from the Montreal vocalist and producer is a daring, eclectic mix of experimental R&B, where intoxicated club nights bleed into sunglasses-and-Advil mornings.\n", "Live": "The Australian singer-songwriter looks to the warm, easygoing sounds of ’70s troubadours on an album that rarely demands attention, only politely asks for it.\n", "Lizzo": "The shiny soul-pop of Lizzo’s major label debut is something of a thesis on internalized and externalized confidence—so much so that the music can feel like a means to a greater end.\n", "Lloyd": "For Selected Studies, Vol. 1, the prolific krautrock elder statesman Hans-Joachim Roedelius collaborated with the bookish singer-songwriter Lloyd Cole by exchanging files online.\n", "Local Natives": "The L.A. band has long carried the flag for a particular strain of SoCal indie, but the follow-up to 2016’s fashionably yearning Sunlit Youth sounds both more personal and more timeless.\n", "Loco": "On their first new album in over a decade, Manchester’s funkiest post-punk band offer an imperfect distillation of their 40-year legacy, updating their classic sound with nods to contemporary beat-driven music and political strife. \n", "Logic": "The Australian producer's latest project creates a sense of spaciousness, tracing the almost forgotten flutters and rushes of a good night out.\n", "London Grammar": "The UK electronic-pop trio’s third album draws on a renewed sense of extroversion and energy, which can’t always overcome its lyrical and production missteps.\n", "Looking Glass": "James Mercer takes his most recent album through the looking glass, flipping songs’ tempos and production styles on an eccentric mission of discovery.\n", "Loon": "San Francisco musician Hannah Van Loon marries the dreamlike eeriness of the weekend’s final hours with the heaviness of shoegaze on a debut album co-written and produced by Toro Y Moi’s Chaz Bear.\n", "Lord Huron": "Ben Schneider's debut LP finds the Michigan-to-L.A. transplant shedding much of the electronic flourishes and international flavors of his early EPs in favor of harmony-rich folk-rock.\n", "Lorde": "On a debut EP that occupies a space between the cathartic stadium pop of fun. and the vulnerability of Lorde, the young singer-producer offers the kind of love songs generations of queer kids craved.\n", "Lorenz": "The Italian electronic producer and arch conceptualist finds a new flamboyance in astoundingly ornate, song-like pieces of deconstructed trance and video-game chirps.\n", "Lorn": "Lorn's debut on Flying Lotus' label is 30 minutes of beat-driven bangers with very few zeitgeist-capturing gimmicks to be found.\n", "Los Amigos Invisibles": "After 2000's disappointing Arepa 3000, this Latin funk/disco crew turn their shit around with production work from house icons Masters at Work.\n", "Los Lobos": "The Los Angeles singer-songwriter’s debut album is an ambitious, bilingual record that hops between influences, echoing the liminal state of a 26-year-old immigrant in America.\n", "Lou Reed": "A new reissue highlights the ongoing relevance of Lou Reed’s opus about his hometown in the era of AIDS and Reaganism, a protest album unlike any other \n", "Louis St. Louis": "The introspective St. Louis rapper builds a self-contained world with his magnetic monotone and intricate, evocative raps.\n", "Louis Tomlinson": "The latest One Directioner to go his own way tackles big themes, but the music is filled with the kind of dead-eyed vocal delivery and lazy drumming, strumming, and writing that all pop stars fear.\n", "Loverboy": "A new “definitive” reissue series begins with the bedroom artist’s earliest Haunted Graffiti records, which now sound more prescient and ghostly than ever.\n", "Low": "The L.A. rapper teams with producer ewonee for a lean and low-stakes album, but its strength is in its brevity.\n", "Lucky Luck": "The London jazz-pop musician is at her most opaque on a new three-song EP, yet these tracks are as evocative and affecting as any in her catalog.\n", "Ludacris": "Ludaversal, Ludacris' first album in five years, is a not-very-subtle attempt at testing his staying power against the current crop of boundlessly engaging Atlanta rappers.  Despite production from current-day heavy hitters like Da Internz and Mike WiLL Made It, he still comes off like a relic from the past, the class clown who never quite grew up.\n", "Ludwig Goransson": "Ludwig Göransson’s spectacular score captures the multiplicity of the fictional nation of Wakanda.\n", "Luigi": "Out-music veterans continue their decade-long collaboration with an album of severe modern classical, harsh noise, and ambient music.\n", "Lupe Fiasco": "On his seventh album, the conscious hip-hop fallback poses a revisionist fantasy about underwater slaves sinking other slave ships—a premise he quickly abandons during these 24 tracks.\n", "Lykke Li": "With festival-ready hooks and trap-inspired production, Lykke Li delivers another record about an unraveling romance and the fraught sexuality of its final moments with diminishing returns.\n", "LÉON": "On their eighth album, the Followill brothers desperately cling to a sound that has stopped working, trying to write songs that soar but capable only of ones that wallow.\n", "M.I.A.": "The new N.E.R.D. album is full of guests: Rihanna, Kendrick, Gucci, 3000, M.I.A., Wale, Ed Sheeran. They all help elevate an album that is occasionally ineffectual in its attempts at protest music.\n", "M83": "Released 12 years after Digital Shades Vol. 1, M83’s new collection of instrumentals doubles as a playful tribute to classic video-game soundtracks.\n", "MARINA": "Marina Diamandis’ first album since shedding her “Marina and the Diamonds” identity slides from affecting poetry to cold calculation.\n", "MAX": "Experimental electronic musicians including Loraine James, Rupert Clervaux, and Oliver Coates tackle the spooky, microtonal source material of this year’s Music for Detuned Pianos.\n", "MC Eiht": "The underrated titan of West Coast gangsta rap stays true to his classic formula on an LP featuring guest verses from spiritual descendants Conway the Machine and Dave East.\n", "MF DOOM": "This comic-book crossover between MF DOOM, Wu-Tang’s Inspectah Deck, and Boston duo 7L & Esoteric attempts to evoke the heyday of underground rap, with mixed results.\n", "MGMT": "MGMT’s fourth album marks a shift in tactics. Abandoning the belabored excess of their last two albums, they opt for streamlined synth-pop.\n", "MINO": "Each Sunday, Pitchfork takes an in-depth look at a significant album from the past, and any record not in our archives is eligible. Today we revisit Alicia Keys’ outstanding 2001 debut, a self-produced, Chopin-inspired R&B album that blazed a unique path to mainstream superstardom.\n", "MISSIO": "Phil Cook, Megafaun member and orbiter of Justin Vernon's universe, turns in a passionate solo album forged out of love for Southern blues and raggedy Blue Ridge folk. He's preaching and, like any good missionary, his fervor is infectious.\n", "Mabel": "This 24-year-old London producer is capable of distinctive and impressively detailed instrumental grime but here he foregrounds his voice, aiming for the kind of dubstep-inflected pop brought to the masses by James Blake.\n", "Mac DeMarco": "The Dutch songwriter follows behind-the-scenes work with Rex Orange County, The Free Nationals, and others with a breezy new solo record. Featuring collaborations with Mac Demarco and Emily King, the album does a good job distilling his charms into a single package. \n", "Machine Gun Kelly": "The Pro Era rapper channels the adolescent moodiness of Machine Gun Kelly and the aspirational navel-gazing of J. Cole.\n", "Machine Head": "Though they once flirted with nu metal, Machine Head have settled into a more experimental and expansive place, with multi-part songs that make use of strings, choirs, and more.\n", "Macklemore": "Macklemore’s new album is a light listen with a couple of good moments and some innocuous clunkers. Does anyone have the energy to be angry at him anymore?\n", "Madeon": "While Adventure carries all the hallmarks of your usual skyscraping EDM release—stomping breakdowns, soaring choruses, maximalism-for-the-sake-of-it—it also straddles a fine balance between being a pop record and being a dance record.\n", "Madison Beer": "Rooted in authenticity but still layered in artifice, the rising pop singer’s debut is ambitious yet shallow, seemingly intent on proving its own seriousness.\n", "Madlib": "On his collaborative album with Four Tet’s Kieran Hebden, the producer, multi-instrumentalist, DJ, and archivist remains masterful by simply turning what he hears into something new and revelatory.\n", "Madness": "The 30th-anniversary reissue of this dream-pop landmark includes a second disc of demos, capturing a celebrated band already eager to move onto new sounds.\n", "Madonna": "Packing 15 producers into 50 minutes, the fun but overstuffed Future Nostalgia rework hopscotches between piano house, Baltimore club, and the kind of dance remixes that power Chelsea gay bars.\n", "Madvillain": "On their first collaborative album, Seattle producer L’Orange and North Carolina rapper Solemn Brigham craft spirited, old-school rap that owes a hefty debt to Madvillain.\n", "Magic": "Each Sunday, Pitchfork takes an in-depth look at a significant album from the past, and any record not in our archives is eligible. Today we revisit the Japanese band’s technically masterful, tremendously expensive 1981 album, a record that looms over 40 years’ worth of electronic production.\n", "Majestic": "For his latest Tobacco collection, Tom Fec of Black Moth Super Rainbow compiles 24 tracks spanning 2007 to present. They testify to his proficiency as an arranger of queasy electronic psychedelia.\n", "Majid Jordan": "The refined sophomore album from Majid Jordan—best known for featuring on Drake’s “Hold On, We’re Going Home”—finds the Toronto duo coasting on an atmospheric pop-R&B sound that is uniquely their own.\n", "Major Lazer": "This brisk, summery, inarguably fun EP features Quavo, Travis Scott, and Jidenna gliding atop the trio’s tropical big-tent beats, which coincide with the all-too familiar riddims of Top 10 radio.\n", "Mako": "Acid Mothers Temple is the perfect band for geeky record collector types: a semi-mythic history, a genuine Guitar God for ...\n", "Maluma": "The reggaeton of the Colombian pop star meets the reggae of Jamaica on a short and sleek album that, as far as cross-cultural projects go, just barely skims the surface.\n", "Man": "Each Sunday, Pitchfork takes an in-depth look at a significant album from the past, and any record not in our archives is eligible. Today we revisit the influential debut from the SoCal band, a pop-punk spark that spread like wildfire in the Tumblr era.\n", "Manchester Orchestra": "Manchester Orchestra’s new album is their most confounding and thrilling work yet, with the most grandiose narrative concepts, production, and arrangements of their career.\n", "Mandy Moore": "The former teen-pop star’s rueful new album explores who you become when the life around you falls apart and you have to build a new one from the ruins of the last.\n", "Manic Street Preachers": "Energized by the success of Journal For Plague Lovers, the Manics return with an album that's grandiose even for them, but they make it work.\n", "Manu Chao": "", "Marci": "On his latest, the Long Island MC exults in the kingdom he’s created within underground rap.\n", "Marcos": "Brooklyn dance label Long Island Electrical Systems's inaugural full-length artist release comes from Marcos Cabral. The producer surfaced in 2008 as one half of Brooklyn duo Runaway and his 2011 solo L.I.E.S.-imprinted 24 Hour Flight EP turned heads to Cabral and the label that released it.\n", "Maren Morris": "On her second album, the country-pop singer remains a powerhouse talent who can sing the hell of out every middle-of-the-road style going.\n", "Mariah Carey": "Mariah Carey, the cultural attaché of Christmas, offers a reissue of her 1994 album, which sounds as timeless as possible for music passed through the innocuous filters of mid-’90s adult pop.\n", "Marilyn Manson": "On his 10th album, Marilyn Manson embraces the tropes that made him a menace and a rock star and a stalwart of goth. This is his turf, and rather than expand it, he seeks to defend it.\n", "Mario": "Columbia University composition grad Mario Diaz de Leon combines an interest in Karlheinz Stockhausen-style modernism with a love of metal, noise, and ambient drones. He's collaborated with members of Wolf Eyes and written for chamber groups, and on his latest album, he combines his interests seamlessly into music that throbs with snarling exuberance.\n", "Mark Ronson": "Produced by Mark Ronson and performed and co-written by a suite of female vocalists, this compilation explores the many shades of heartbreak in current pop.\n", "Maroon 5": "Adam Levine’s band return for their sixth album of smooth, professional, antiseptic soft-rock, which somehow also features Kendrick Lamar, Future, and A$AP Rocky.\n", "Marshmello": "On his second album, the quasi-anonymous DJ in a stylized marshmallow mask proves the perfect figurehead for a commercial EDM scene running on fumes.\n", "Marvin Gaye": "Recorded in 1972, this largely unreleased “lost” album is a fascinating glimpse into what one of the great 20th-century artists strategically allowed the culture to see.\n", "Mary Mary": "The unflinching and brutal new record from the Melbourne-based singer-songwriter is so direct that it demands your full attention for every single second.\n", "Masego": "All cognac and white linen, the Virginia R&B musician’s debut album is steeped in quiet storm and beefed up with crisp drums and booming production: a sophisticated, seductive mix.\n", "Massive Attack": "On Mezzanine, Massive Attack tried to escape trip-hop. They nearly tore themselves apart and made its defining document instead.\n", "Mastodon": "The new Mastodon EP is an eclectic, psychedelic journey that sees guitarist/vocalist Brent Hinds picking up a Sho-Bud 13-string pedal steel guitar. His mastery of the instrument is quickly clear.\n", "Matisyahu": "The fratboy and magazine editors' reggae star of choice gets assistance from Sly & Robbie and Bill Laswell on his new EP, which comes packaged with a live DVD.\n", "Mavado": "Jamaican dancehall star compiles singles and new material into a lengthy album, using dirge-like martial beats to develop a persona as a remorseful, weary thug.\n", "Maxwell": "The reissue of Maxwell’s second album from 1998 showcases the mercurial spirit that followed the R&B auteur down new, aqueous corridors.\n", "Mazzy Star": "Each Sunday, Pitchfork takes an in-depth look at a significant album from the past, and any record not in our archives is eligible. Today, we revisit a dream pop classic, a spare and gauzy outpouring of feeling that still ripples through modern music.\n", "Mecano": "And so another Martin Luther King Day has come and gone and with hardly more than a passing notice. Banks ...\n", "Medicine": "Dave Grohl’s lawful-good lifestyle presents an eternal conflict between being unable to hate the guy and being unable to enjoy the music he continues to make.\n", "Meek Mill": "Despite being born of injustice, an air of victory hangs over Meek’s first full-length since he was released from prison. It captures an intensity that the Philadelphia rapper is known for and best at.\n", "Megadeth": "Circa 1986 was a very good time for metal, and Megadeth's awesome entry from that year has been given an expanded reissue.\n", "Megan Thee Stallion": "On his fifth solo album, the Memphis legend invites guests like Jay Rock and Megan Thee Stallion, splitting the difference between coasting and staying fly.\n", "Meghan Trainor": "The pop star attempts to be all things to all people, offering an overstimulating mix of sounds and a message of self-flagellation disguised as empowerment.\n", "Merle Haggard": "These three country legends-- no strangers to collaboration with one another-- offer a 2xCD set that includes two Nelson/Haggard tracks plus 20 covers of tracks penned by Lefty Frizzell, Floyd Tillman, and Kris Kristofferson, among others.\n", "Metallica": "Two decades later, Metallica reunite with the San Francisco Symphony for a chiefly fans-only document that adds more needless orchestration to already orchestral metal songs.\n", "Method Man": "Method Man's first solo album since 2006 is a throwback to Wu-Tang’s mid-2000s wilderness period where the leading figures tried to establish independent fiefdoms outside of RZA’s view.  Raekwon and Inspectah Deck guest.\n", "Metric": "Emily Haines leads her band into their seventh album with their own sound, immune to trends and the zeitgeist, full of big, broad rock anthems.\n", "Metro Boomin": "The sequel to the canonical Atlanta mixtape is meant to be a legacy-defining stamp, but despite all its glossy guest stars (Morgan Freeman!), it never rises above “just fine.”\n", "Metronomy": "A casual approach gives rise to some of the English electro-indie band’s best songs in years. But for anyone not already misty-eyed with nostalgia, a meandering 17-track album is a hard sell.\n", "Mez": "On Mezzanine, Massive Attack tried to escape trip-hop. They nearly tore themselves apart and made its defining document instead.\n", "Michael Jackson": "At the time of Dangerous, Michael Jackson's universal popularity was on par with pizza and the polio vaccine. It was the last time that Michael Jackson was Michael Jackson.\n", "Michael Kiwanuka": "The London singer-songwriter's Danger Mouse and Inflo-produced latest feels like an easy listen at first, but eventually reveals its mournful and even despairing heart. \n", "Michael McDonald": "The erstwhile Doobie Brothers leader and Steely Dan associate’s first album in 20 years is more of an urbane R&B labor of love than an attempt to capitalize on his resurgent popularity.\n", "Michelle Branch": "With help from the Black Keys’ Patrick Carney and erstwhile pop star Michelle Branch, the DIY icon finds new ways to tease out light and dark, allure and anxiety with his key-ignoring baritone.\n", "Mick Jenkins": "On what he’s called a “prelude” to his next album, the Chicago rapper sets aside the big themes of previous records and luxuriates in letting his mind wander.\n", "Midland": "The Russian techno DJ Nina Kraviz enlists Jlin, Buttechno, Midland, and others in remixing all 13 songs from Annie Clark’s 2017 album, to sometimes scattershot effect.\n", "Miguel": "Featuring habitual collaborators like Jamael Dean and Miguel Atwood-Ferguson, the L.A. percussionist and producer’s sprawling, shape-shifting seventh album finds joy in unexpected connections.\n", "Miike Snow": "The Swedish trio, including the production duo Bloodshy & Avant (Britney Spears, Kelis, Kylie Minogue), offer springy electronic pop on their sophomore LP.\n", "Mike D": "On his bleakly comic new album, Open Mike Eagle surveys the damage of one terrible year, using anime mythology as a lens for examining real-life pain.\n", "Mike S": "The Purling Hiss frontman teams with Kurt Vile for a record of simple folk songs pairing blissful sounds with plainspoken sentiments.\n", "Mike Shinoda": "On his debut solo album, the Linkin Park rapper and producer mourns the death of his bandmate Chester Bennington but never translates that grief into candid lyrics or inspired songwriting.\n", "Mike WiLL Made-It": "Whereas the first Creed soundtrack reached for the rafters, the sequel is placeless and tame. Its only muse seems to be Mike WiLL’s contact list.\n", "Mikky Ekko": "Mikky Ekko's debut Time features bigtime collaborators—Ryan Tedder, Dave Sitek, Clams Casino, Jeff Bhasker—and makes for an eclectic set of hooky pop.\n", "Mild High Club": "On their third full-length of 2017 alone, the Melbourne psych-rock band are surprisingly agile, incorporating soul, jazz, North African overtones, and pastoral English folk.\n", "Miles Davis": "Taking cues from Miles Davis’ electric period, the Spacebomb Records founder and Alabama sculptor join forces on a mesmerizing album rooted in improvisation, risk-taking, and unlikely musical chemistry.\n", "Miles Kane": "The louche UK singer returns with an album that thrusts ahead quickly and painlessly but leaves you itching to shower off its overpowering cologne the second it’s over.\n", "Miley Cyrus": "Stepping confidently into her “rock era,” Miley offers a genuinely pleasing, though sometimes hamfisted record that staves off the awkwardness and missteps that plagued her previous albums.\n", "Miller": "The first posthumous album from Mac Miller plays like a companion piece to Swimming. It’s an optimistic epilogue to the life of an aspirational artist.\n", "Milton Nascimento": "Each Sunday, Pitchfork takes an in-depth look at a significant album from the past, and any record not in our archives is eligible. Today, we revisit one of the most ambitious albums in Brazilian history.\n", "Miranda Lambert": "Each Sunday, Pitchfork takes an in-depth look at a significant album from the past, and any record not in our archives is eligible. Today, we revisit the stellar rise of Miranda Lambert with her second album, one that laid the groundwork for an artist destined for country superstardom.\n", "Miranda!": "Each Sunday, Pitchfork takes an in-depth look at a significant album from the past, and any record not in our archives is eligible. Today, we revisit the stellar rise of Miranda Lambert with her second album, one that laid the groundwork for an artist destined for country superstardom.\n", "Misfits": "USA/Mexico are sludgy, nasty, and unclassifiable, meaning they fit perfectly into Austin's coterie of noise-rock misfits.\n", "Missy Elliott": "The pop music icon spends too much time looking back on a seemingly rushed, mostly forgettable collection of tracks.\n", "Mitra": "For the last two years, Greg Fox has worked with a dozen projects, but his name has been chased by one thorny apposition: (ex-Liturgy). With two new releases, Guardian Alien’s near-brilliant second LP and a collaboration with jazz pioneer Milford Graves, he may have finally drummed himself past parenthetical suffixation.\n", "Mitski": "The fifth album from the singular songwriter is her greatest to date. From the music to her emotions, Mitski has the power to make the complex seem dazzlingly clear.\n", "Mobb Deep": "Havoc and Prodigy have reissued their classic album The Infamous via a PledgeMusic-funded project. In addition to the original album, they are including a disc of rare and unreleased tracks from the sessions along with a full new album, confusingly, called The Infamous Mobb Deep.\n", "Moby": "Richard Melville Hall is back to doing what he does best: making soaring electronic music for billboard-sized emotions. Introspection? Not so much.\n", "Modern Baseball": "On his third album, Jake Ewald reunites with former Modern Baseball bandmate Ian Farmer to explore pared-down folk-rock. It’s the furthest from MoBo he’s ever sounded.\n", "Mogwai": "The Scottish band is on familiar ground, patiently building mountainous songs suffused in nameless sadness, but they sound energized by the darkness—and refreshingly resistant to self-seriousness.\n", "Molchat Doma": "The Belarusian new wave band’s latest album is an austere gothic dream with no interest in pandering to the audience attracted by their improbable TikTok breakthrough.\n", "Momo": "Elvis Costello releases his first Imposters album in a while, and it's the best of all that would imply-- a fiercely melodic record that sinks or swims on the dynamics of his band. Jenny Lewis guests.\n", "Monica": "Long considered the best David Bowie show on record, this 1972 performance-- which finds the legend still feeling his way into stardom-- gets a 2xCD and vinyl release.\n", "Mora": "These live sets between the saxophonist and pianist capture a dialogue between two highly skilled and empathetic collaborators, whose reverence for space matches their regard for the music itself.\n", "Morcheeba": "UK trip-hop chancers attempt their first record without former vocalist Skye Edwards.\n", "Morgan Wallen": "With a 30-song record, the rising country star takes a closer look at Music Row clichés, writing in easy, idiomatic shorthand that plunges you directly into his world.\n", "Moris": "On her first album in eight years, the iconic singer-songwriter continues to take the lyrical road less traveled on a vulnerable, sedate, ballad-heavy album. \n", "Morrissey": "Mildly captivating, occasionally repetitive, and frequently ridiculous, the 13th studio album from the fabulous sulk turned red-pill pharmacist is Moz’s vision of radical truth-telling.\n", "Mos Def": "Rapper's first solo album in almost three years is a small-globe statement that jumps stylistically across continents on a hip-hop goodwill-ambassador tour.\n", "Mother Mother": "On their mesmerizing collaborative album, the gnomic NYC rapper and the avant-garde poet and musician piece together ideas and sounds from history’s jagged shards.\n", "Moti": "With unexpected musical contrasts that evoke a constant sense of uncertainty, composer Jung Jae-il’s score hints at what lies beneath the characters’ superficial appearances.\n", "Motörhead": "The 21st Motörhead album is packed with uptempo ragers, the kind of songs Lemmy seems to stockpile in unlimited supply, and Aftershock's brief song lengths and wealth of unshakeable choruses remind you he's just as fixated on catchiness and concision as on speed and power.\n", "Mouse": "The experimental duo have long embraced music’s anarchic potential. Their latest project, exploring the nuances of machine intelligence, might be their most confounding and ambitious.\n", "Mozzy": "The Sacramento rapper’s new release doesn’t compromise on his bleak worldview, but the music feels warmer and more accessible.\n", "Mr Eazi": "Across five breezy, feel-good songs, the rising Afropop star continues to explore the overlap between the sounds of Ghana and those of his native Nigeria.\n"}